{ clubs: [{"name": "4N01", "description": "Established in 2010, 4N01 is an all female hip hop dance group based in San Diego. We don't have a specific style, but our team is a group of diverse dancers who come from different backgrounds with different skills, talents and experience levels. Our set represents our love, passion and diversity. We don't focus on how good you are when you start, but how hard you work to get better."}, {"name": "A Capella Choir", "description": "To provide anyone with a passion for singing a place to sing with others with the same goals and passion. The organization will be run in part by the other A Capella groups on campus, and the main focus will be on improvement. "}, {"name": "AB Common Ground", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Empower Hour", "description": "Life after prison is difficult, with many struggling to find their place in society. By addressing the challenges created by their imprisonment, we hope to help and support women with their efforts to reintegrate into society. We aim to empower these women and their children, who are at risk of getting caught in the prison cycle. We will educate ourselves on these issues so we can actively be involved in the daycare and after-school program for the children and effectively communicate with the women as we help out in their thrift store and facilitate workshops. Through our strong, direct service and interactions with the women and their families, we hope to make a positive, lasting impact that will help them break out of the cycle of intergenerational incarceration.\r\n"}, {"name": "AB Empower Youth", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Executive Board", "description": "Alternative Breaks are national or international service learning trips that use education of social justice issues combined with quality direct service to have a lasting impact on students and the communities they work in. "}, {"name": "AB Food for Thought", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB HEY", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB HKO", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Hope House", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Next Generation", "description": "Alternative Breaks are local, domestic, or international service learning trips that use education of social justice issues combined with quality direct service to have a lasting impact on students and the communities they work in. "}, {"name": "AB Raise the Roof", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Re-Member", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Safe and Sound", "description": "AB Safe and Sound is within Alternative Breaks at UCSD. Our purpose is to educate a team of students on the social justice issue of HIV/AIDS and sexual health. We will be traveling to Belize during spring break to volunteer at a high school to lead educational workshops. "}, {"name": "AB Sees YOU", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB Serve to Sustain", "description": "Alternative Breaks are local, domestic or international service learning trips that use education of social justice issues combined with strong direct service to have a lasting impact on students and the communities they work alongside."}, {"name": "AB@UCSD: Alternative Weekends", "description": "Alternative Weekends inspire and connect the UCSD community to the SD surrounds through active awareness and education of a wide range of social justice issues."}, {"name": "Academic Connection of Engineers (ACE)", "description": "The mission of ACE is to facilitate active group study to foster academic achievement and social development among undergraduate engineering students. Further, this organization will exist to:\r\n1.\tAssist each member to achieve his or her own academic potential\r\n2.\tProvide students with the environment to build lasting relationships with other engineering students\r\n3.\tCreate a medium in which students can develop their leadership and team problem-solving skills\r\n4.\tEncourage students to establish connections with faculty and alumni of the engineering department. \r\n"}, {"name": "Academic Integrity Peer Educators", "description": "The purpose of the Academic Integrity Peer Educators is to have students involved in advocating for the importance of Academic Integrity at the University/College and High School levels. The Peer Educators will help UCSD students who have allegedly violated our policy on Integrity of Scholarship go through the administrative process and learn from the experience; they will help all UCSD students to understand the importance of academic and professional integrity and to practice skills at acting ethically and will assist in creating a culture where integrity is an expected and valued norm. The Academic Integrity Peer Educators is a non­profit organization."}, {"name": "Acamazing", "description": "Acamazing is a co-ed a cappella group which seeks to provide a fun and enriching environment for singers and aspiring singers to make music without the use of instruments. We aim to nurture the musical talent of UCSD students and to entertain ourselves, ?the UCSD community, and the general public. Additionally we hope that all members gain a better understanding of music and enrich their own musicality while building lasting friendships with their fellow members. \r\n"}, {"name": "Active Minds", "description": "Active Minds at UC San Diego is a non-profit, student-run mental health awareness, education, and advocacy organization on campus. Through our programs, events, and collaborations, we will seek to promote mental health awareness on campus and the overall psychological well-being of UC San Diego students. "}, {"name": "Acts 2 Fellowship", "description": "\"We are a fellowship that strives to build a Christ centered community on campus. We meet weekly for Bible studies & prayer, and worship on campus on Sundays. Our vision is to share the gospel and help students to spiritually thrive during college.\""}, {"name": "Afghan Student Association", "description": "Our mission is to preserve, embrace, and foster Afghanistan's rich culture and traditions through social events and activities University of California, San Diego. The students part of ASA will strive to educate people about the Afghan heritage, thus help others out and empower one another. "}, {"name": "African Student Association", "description": "To serve and educate the UCSD community about African history, traditions, customs, happenings, and culture. "}, {"name": "Alliance for Students With Chronic Illnesses", "description": "Our organization’s purpose is to create a safe and welcoming environment for students with chronic illnesses where they can meet one another and share life experiences. We seek to promote healthy living and support for one another. "}, {"name": "Alpha Chi Omega", "description": "Friendship, leadership, learning, and service. "}, {"name": "Alpha Epsilon Delta Pre-Health Professional Honor Society", "description": "A pre-health honor society with the purpose of connecting future health professionals and recognizing their achievements in their pursuit of a career in health. Activities include volunteering, educational programs and speakers at bi-weekly meetings including doctors, nurses, patients, medical students, pharmaceutical students, and more."}, {"name": "Alpha Epsilon Omega, Eta", "description": "The purpose of this organization is to unite men who share high standards of achievement in all aspects of life, and to unite those men who share in the need of promoting Armenian history, language, and culture. "}, {"name": "Alpha Epsilon Phi", "description": "To establish and maintain sisterhood of college/university women for social, educational, charitable and other non-profit purposes while taking pride in our Jewish founding."}, {"name": "Alpha Epsilon Pi", "description": "To promote Jewish leadership in the community, and create a strong brotherhood for our members."}, {"name": "Alpha Gamma Alpha", "description": "Alpha Gamma Alpha, Inc. is the first Armenian-based sorority nationwide. The goal of the Founding Mothers was to establish a sisterhood that unifies diverse women and provides them with an opportunity to make lifelong connections while making a difference within their communities.\r\n\r\nWe are proud to have established the Zeta chapter at the UC San Diego campus in 2007.\r\n\r\nFor information on becoming part of the legacy which is Alpha Gamma Alpha, contact the sisters at ucsdaga@gmail.com."}, {"name": "Alpha Lambda Mu", "description": "Our Mission is to establish a Muslim Network as well as a Brotherhood dedicated to not only improving ourselves but our communities. We hope to develop each and every brother into a community leader who will go back and help out their communities when they graduate and leave us. Above all, our mission is to better ourselves as People, for we are the future and if we ever want the future to be brighter, we must enlighten ourselves first.\r\n\r\nThe following are excerpts from the Official Alif Laam Meem facebook page:\r\n\r\nThe Alpha Lambda Mu National Muslim Fraternity has been founded upon and promises to strive to promote among its members:\r\n\r\nAn everlasting bond between brothers as they lead their communities in service. \r\n\r\nReligious, academic, and extracurricular successes that benefit the individual, the family, and the community.\r\n\r\nTo build and develop integrity, honesty, respect, and the highest character among each member within the Alpha Lambda Mu National Muslim Fraternity."}, {"name": "Alpha Omega", "description": "Members aim to encourage and help each other follow Jesus, while also seeking to make Him known to others around campus in the process."}, {"name": "Alpha Omicron Pi", "description": "The object of Alpha Omicron Pi Women’s Fraternity shall be to encourage a spirit of Fraternity and love among its members; to stand at all times for character, dignity, scholarship, and college loyalty; to strive for and support the best interest of the colleges and universities in which chapters are installed, and in no way to disregard, injure, or sacrifice those interests for the sake of prestige or advancement of the Fraternity or any of its chapters."}, {"name": "Alpha Phi", "description": "Alpha Phi is a sisterhood of outstanding women supporting one another in lifelong achievement.\r\n"}, {"name": "Alpha Phi Omega", "description": " Alpha Phi Omega is a co-ed service fraternity organized to provide community service, leadership and social opportunities to college students. The purpose of this fraternity is to assemble college students in a national service fraternity in the fellowship of principles derived from the Scout Oath and Law of the Boy Scouts of America; to develop leadership, to promote friendship and to provide service to humanity; and to further freedom that is our national, educational and intellectual heritage"}, {"name": "Alternative Breaks@UCSD", "description": "Alternative Breaks are local, domestic, or international service learning trips that use education of social justice issues combined with quality direct service to have a lasting impact on students and the communities they work in."}, {"name": "Ambience (formerly known as Light Show Shuffle Disco)", "description": "Ambience Glove Lightshows at UCSD is dedicated to creating a safe and sober environment for people to learn, practice, and trade lightshows. However, Ambience is not just a club on campus; we are a movement. A movement for all the lightshow artists out there who love this form of art and want to see it become accepted in the performance art community. We are not here to make gloving mainstream, but rather to spread awareness and give people the opportunity to become more exposed to the culture."}, {"name": "American Advertising Federation at UCSD (AdWave)", "description": "The American Advertising Federation at UCSD (Adwave) provides an educational and professional platform for students to develop their abilities for an advertising and/or marketing career. We aim to inspire and bring together the brightest and most creative minds at UCSD."}, {"name": "American Chemical Society Student Affiliates (ACSSA)", "description": "To serve UCSD chemistry majors by providing a friendly environment for the intellectual exploration of relevant industrial chemistry and chemical research topics. We aim to provide students interested in science with networking, outreach and volunteering opportunities that will help them define their goals, choose their career path and pursue their intended career. La Jolla"}, {"name": "American Institute of Aeronautics and Astronautics (AIAA)", "description": "To promote interest in the field of aeronautics and astronautics."}, {"name": "American Institute of Chemical Engineers (AIChE)", "description": "To provide chemical engineering students with the most beneficial experience at UCSD through industry, career-building, and social events. We seek to promote academic, social, and professional growth for the chemical engineering community. "}, {"name": "American Medical Student Association", "description": "UCSD AMSA pre-medical chapter is dedicated to providing valuable resources for pre-medical students here at UCSD, as well as presenting opportunities for involvement in the health-care community. This year, our chapter will also be partnering up with the UCSD Medical School chapter to provide mentoring and joint community activites for our pre-medical students. It will be a wonderful opportunity for students to learn what medical school is like and to make valuable connections with students who have already been through the rigorous admissions processes required for medical school. "}, {"name": "American Pharmacists Association APhA-ASP at UCSD SSPPS", "description": "Our mission is to be the collective voice of student pharmacists, to provide opportunities for professional growth, and to envision and actively promote the future of pharmacy.\r\n\r\nWe are dedicated to increasing health awareness and addressing the health concerns of the San Diego community."}, {"name": "American Society of Mechanical Engineers", "description": "We will provide students with opportunities to meet with members of the mechanical engineering community and offer involvement in our two main project teams, the Human Powered Submarine Team and the Sample Return Robot/Rover Team."}, {"name": "Anime Comic Club", "description": "We aspire to foster a uplifting community for sharing, entertainment and production within the culture of ACG (anime, comic/manga, video games)."}, {"name": "APD Consulting Club at UCSD", "description": "The APD Consulting Club at UCSD has the following objectives:\r\n•\tTo inform graduate-level students about possible careers in consulting \r\n•\tPrepare graduate-level students to attain consulting jobs\r\n•\tProvide a career building resource focused on consulting\r\n•\tCreate an alumni network of advanced professional degree consultants from UCSD\r\n"}, {"name": "App Developers @ UCSD", "description": "Bridging our community to Silicon Valley with practical knowledge and experience by offering competitive app development bootcamps, team projects, mock interviews, and internship recruitment opportunities using curriculum and mentorship from existing partnerships with established tech companies such as Facebook, Google, Apple and Uber."}, {"name": "Application of Stable Isotopes in Natural and Social Sciences", "description": "To allow for the discussion of data and best practices regrading the use of stable isotopes in natural and social sciences. "}, {"name": "Architecture at UCSD", "description": "To support interest in architecture on campus and encourage student engagement in built environments. "}, {"name": "Argentine Tango Club", "description": "To build and sustain a community that gathers to practice and promote Argentine Tango at UCSD."}, {"name": "Armenian Student Association", "description": "To promote an understanding of the Armenian culture and foster awareness about issues of concern in the Diaspora and the Homeland to the campus community of UC San Diego. "}, {"name": "Army ROTC at UCSD", "description": "The purpose of this club is to provide Army ROTC participants at UCSD a club where they may discuss Army training, job possibilities and work out together in order to foster \r\na sense of unity with their ROTC peers. "}, {"name": "Asayake Taiko", "description": "To promote cultural awareness and inclusivity in the UCSD and San Diego communities by sharing our love, passion, and respect for the art of taiko through performance."}, {"name": "Ascension Hip Hop Dance Team", "description": "Ascension was founded in 1999 and embraces the principles of community in order to create a family for our members. As UCSD's longest-running competitive hip hop dance team, we strive to become better than the team we were yesterday by learning from and inspiring one another.\r\n"}, {"name": "Asian American Christian Fellowship", "description": "The mission of Asian American Christian Fellowship (AACF) is to reach into the university and collegiate community, primarily to those who are Asian Pacific Americans, with the life-changing message of Jesus Christ. ~ you don't gotta be Asian, or American, or Christian to come check us out! :)"}, {"name": "Asian and Pacific Islander Student Alliance (APSA)", "description": "We, the students of University of California at San Diego (UCSD), come together to provide a forum to deal with the problems and concerns of UCSD Asian and Pacific-Islander (API) students, especially those deemed “underrepresented” by the Student Affirmative Action Committee (SAAC); to try and create an environment where issues such as those political, educational, cultural and social can be addressed; to increase awareness about our API history and heritage within the university and the community; to unite as a community resource to represent a common voice and thereby empower ourselves; and to serve as a support network for building bonds and addressing differences between students. The Asian and Pacific-Islander Student Alliance is a non-profit organization."}, {"name": "Association of Indian Graduate Students", "description": "To conduct events based on Indian culture and provide a congenial atmosphere for students belonging to the Indian community."}, {"name": "Association of Robotics Grad Students at UCSD", "description": "The primary purpose of Association of Robotics Grad Students at UCSD is to enable graduate students to share their research, meet other students working on robotics at UCSD, and learn about what other research is taking place at UCSD to foster potential interdisciplinary collaborations."}, {"name": "Association of Student Pharmacists at UCSD Skaggs School of Pharmacy", "description": "The purpose of this association shall be the development, promotion, and enhancement of the knowledge of pharmacy in the community, all in harmony with the educational interests of the University of California, San Diego Skaggs School of Pharmacy."}, {"name": "Astronomy Club at UCSD", "description": "This club is for UCSD undergraduates who are interested in astronomy to get together, learn astronomy knowledge, do observations, connect with astrophysics faculties and have fun. We also aim to share our interest in astronomy with more schoolmates."}, {"name": "AVID Alumni Association", "description": "The purpose of this organization is to create a network of support for former AVID students attending UCSD as well as accommodate other UC San Diego students. The UCSD AVID Alumni Association will uphold AVID’s mission statement by preparing all students for a successful transition into our global society. The AVID Alumni Association hopes to fulfill its mission by providing service, professional networking, increasing college persistence rates, and engaging in effective collaborations and partnerships with school and community organizations. We plan on establishing a figurative bridge that will make the transition the University of California, San Diego less difficult for incoming freshmen, while also providing upperclassmen with the resources they need to be successful in their respective college and career aspirations."}, {"name": "Baha'i Club", "description": "To promote awareness about The Baha'i Faith and promote the unity of mankind."}, {"name": "Ballet Folklorico la Joya de Mexico", "description": "To engage members in a cultural understanding of Mexican Folk dance."}, {"name": "Beat @ UCSD, The", "description": "To provide a fun and lively atmosphere to continue our passion for a cappella music at the collegiate level; to immerse members into the a cappella community on-campus and beyond; to strengthen and improve vocal and musical ability; to provide entertaining performances; and to foster close-knit relationships within the group."}, {"name": "Beta Theta Pi", "description": "To develop men of principle for a principled life."}, {"name": "Bhagat Puran Singh Health Initiative (BPSHI)", "description": "The Bhagat Puran Singh Health Initiative aims to eliminate health and social misconceptions within underserved and underprivileged populations by providing access to health education and free health clinics for the betterment of the body.  "}, {"name": "Bioengineering Graduate Society", "description": "The Bioengineering Graduate Society (BEGS) aims to be an interface for\r\nbioengineering graduate students at UC San Diego, their department, and the local\r\ncommunity. Since its creation in 1994, the BEGS mission is to foster professional,\r\neducational, and social development opportunities through relationships with industry,\r\nalumni, and students. BEGS is a graduate student-run organization with the aid of the\r\nBioengineering Department."}, {"name": "Biological Sciences Student Association", "description": "With nearly 20 percent of the UCSD undergraduate population declared as biology majors, the Biological Sciences Student Association (BSSA) plays a crucial role in expanding opportunities and enhancing the overall educational and social experiences of these students during their time here. In addition, BSSA assists in preparing students for a wide range of career opportunities."}, {"name": "Biology Education and Art for Science Innovation (BioEASI)", "description": "The mission of BioEASI is to facilitate the interaction between scientists and the public through outreach, education, and the arts. BioEASI aims to increase public interest and support for basic scientific research and to enhance communication and creative-thinking skills of its graduate student members. BioEASI believes that by achieving these aims, we can help further scientific innovation, recruit the next generation of diverse young people into scientific careers, and increase scientific understanding among the general public."}, {"name": "Biomedical Engineering Society (BMES)", "description": "To foster the growth of students interested in biomedical engineering through professional development and the mutual engaging of industry, alumni, and the local community."}, {"name": "BioScholars Program (formerly Biological Science Scholars Program)", "description": "The Biological Sciences Scholars Program (BSSP) is committed to promoting excellence in scholarship, service, and leadership among the Biological Sciences Scholars and the UCSD community.\r\nBSSP is a learning community dedicated to providing undergraduate students:\r\nsupport for student transition to UCSD and the Biology community\r\nestablishing a connection with biology peers\r\nexploration of issues and opportunities in the sciences and professions\r\nunderstanding of the diversity of UCSD and the field of science\r\nopportunities to enhance leadership skills\r\nguidance to resources and faculty to assist students on their science journey"}, {"name": "Black Graduate Student Association", "description": "The objectives of the Black Graduate Student Association1 are\r\n(1) to support a network of individuals dedicated to the advancement of African-American and black\r\nscholarship\r\n(2) to encourage minority undergraduates to commit to postgraduate education\r\n(3) to promote the general campus welfare via cultural interchange\r\n(4) to provide a forum for social networking and community building\r\n(5) to provide a space for open dialog and discussion about issues confronting black graduate students"}, {"name": "Black Student Union", "description": "To inspire, enlighten, and uplift the Black/African American community on the campus of UCSD through academic, social, and cultural programming. The goal of the Black Student Union is to create successful Black/African American student leaders. "}, {"name": "Board Game Club", "description": "The purpose of the Board Game Club is to bring members of the board game community together and create a social setting to play, create, and discuss strategies to board games."}, {"name": "BOOK Club", "description": "The purpose of our organization is to cultivate a passion for books. We aim to create a friendly environment where people can discuss their favorite books and expand their literary horizons. This club is for anyone, whether you are an experienced reader or would like to get into books!"}, {"name": "Break the Silence", "description": "Break the Silence is a non-profit student organization that provides a safe space for students to explore their talents by sharing their own or someone else’s poetry. The organization fosters a welcoming environment for those who enjoy listening to and/or performing different types of poetry. Break the Silence encourages an interest in discovering the art of spoken word and other forms of poetry in order to promote innovation and creativity at UC San Diego. \r\n"}, {"name": "Breakin' Club- Body Rock", "description": "Body Rock at UCSD is a student organization that strives not only to bring together the breaking community through dance and music, but also to provide the space for bboys and bgirls to develop their breaking skills and for those who want to learn about the elements of breaking in hip hop culture."}, {"name": "Brilliantly Bookish", "description": "The purpose of our club is to create a friendly environment where people can express their love of books and encourage to foster a similar love for reading throughout their community. "}, {"name": "CaHPSA at UCSD", "description": "California Health Professional Student Alliance (CaHPSA) at UCSD aims to foster leadership and advocacy skills among health professional students to increase health equity, primarily through grassroot efforts, education and chapter growth, in support of comprehensive, guaranteed healthcare for all Californians. We work to create opportunities to network with professionals in an effort to engender a sense of professional responsibility among students to empower them to advocate for a health system change. We hope to educate students on the issues of the current healthcare system and inform them of more efficient healthcare models such as Single-Payer.\r\n"}, {"name": "Cal-Animage Beta", "description": "To present Japanese animation subtitled in English to Members of the club. We intend to engender a social atmosphere in which members can enjoy anime and learn about Japanese culture."}, {"name": "California Society of Health-System Pharmacists- at UCSD Student Chapter", "description": "The mission of the UCSD, Skaggs School of Pharmacy and Pharmaceutical Sciences, Student Society of Health-System Pharmacists is to make students aware of pharmacy practice in health systems and the potential of this setting for expanding the base of pharmacy practice, provide information to students about career directions in and credentials needed for pharmacy practice in health systems."}, {"name": "CALPIRG at UCSD", "description": "We are UC San Diego's students' public interest group, and have been since 1976. We are focused on getting real results through student-driven campaigns on issues that matter. We offer opportunities for students to become an intern or volunteer, where they can learn a variety of skills while really making a difference. Our strategies include petitioning, lobbying local and state representatives, building coalitions with other student organizations, and educating the campus on the issues we campaign on."}, {"name": "Calvary Korean Christian Group", "description": "The purpose and goal of the Calvary Korean Christian Group (CKCG) is to promote the Christian culture, bible study and mission of its members and the university community through involvement and participation in various social and cultural activities. We shall maintain our responsibilities to our fellow students, to the university, and to the Korean community to provide spiritual and cultural development for students."}, {"name": "Cambodian Student Association", "description": "We, a non-profit organization called the Cambodian Student Association (CSA) of the University of California, San Diego (UCSD), believe that by (1) building and strengthening identification of the Cambodian culture among fellow members, students and community at large, (2) offering consistent academic, social and moral encouragement through activities and community service and (3) developing social networks that will assist us during our time in college and in our lives thereafter, we will have established rare relationships and support systems based on common principles and values with fellow members who share common interests."}, {"name": "Camp Dragonfly", "description": "Helping underprivileged kids go to camp."}, {"name": "Camp Kesem", "description": "Camp Kesem at UCSD provides a free summer camp to children ages 6-18 in the San Diego community who have/had a parent with cancer. "}, {"name": "Campus Crusade for Christ", "description": "Win, Build, and Send: turning lost students into Christ-centered laborers."}, {"name": "Cancer Outreach Team", "description": "Our mission is to reduce cancer morbidity and mortality among the Pan-Asian community by educating UCSD students about appropriate cancer control measures and providing opportunities for those students to disseminate their acquired knowledge to the Pan-Asian community at-large. Our team is a non-profit, student-run organization and has been operating continuously since 1994."}, {"name": "Catholic Student Community (CSC)", "description": "We are students, alumni, faculty and staff at UCSD, as well as young adults and residents of the surrounding area who celebrate life together as the Catholic Community at UCSD. \r\n\r\nWe feel at home in this community and are free to experience Christ's presence in the Word, in the Eucharist and in each other. Hospitality and welcome are hallmarks of our community. \r\n\r\nWe are passionate about living the Gospel in the context of our Catholic faith."}, {"name": "CEC (Chinese Evangelical Church)", "description": "LIFE Fellowship is a Christian group (associated with Chinese Evangelical Church - CEC) that fosters a unified community of college students who love Jesus Christ.  Through small groups, prayer, worship, and service activities, we seek to understand God's love for us, how to live a life pleasing to God, and spread the gospel to other people."}, {"name": "CHAARG", "description": "CHAARG at the University of California, San Diego is established for the expressed purpose of helping students on the University of California, San Diego’s campus learn that living a healthy + happy lifestyle is something that is attainable and fun through the resources provided at the University of California, San Diego and the surrounding area. CHAARG was founded on the belief that we are stronger as a community and to give college students the ability to be a part of something larger than themselves that will motivate + inspire them to become the best version of themselves through helping one another reach their health + fitness goals.  \r\n"}, {"name": "Chabad at UCSD", "description": "The purpose of Chabad of UCSD is to be a non-profit organization that helps students get involved with the Jewish community on campus through organized group events and activities. We will provide professional and social networking events that help members acquire knowledge on Judaism and meet other students with similar interests. Chabad of UCSD will educate and inform interested students about the basics of Judaism, ideas and beliefs, Israel, Jewish practices and holidays, and Jewish culture."}, {"name": "Chaldean American Student Association (CASA)", "description": "The purpose of CASA is to connect students through the middle eastern culture and expand their views on the essence of what it means to be a Chaldean-American. Also, our goal is to raise money for the Iraqi refugees making their way to San Diego as they flee religious persecution. To add to that, if possible, we would love to share some of the money raised in the form of an academic scholarship at our local church's yearly graduation ceremony. All proceeds are for a charitable cause. "}, {"name": "Chancellor's Scholars Alliance", "description": "To promote service, academic development, leadership, and a sense of community among recipients of the UCSD Chancellor’s Scholarship through volunteer and community service opportunities, social events, and  organized meetings."}, {"name": "Che Cafe", "description": "The Che Cafe is a community space for both the greater San Diego community and the University of California, San Diego. We identify this space as \"Do It Yourself\" venue, vegan cafe, resource center for radical grassroots activists. Furthermore, we open this space to people who would like to add to the space while at the same time dismantle hierarchies. The Che Cafe Collective organizes numerous political and social events for all ages and allows vegan groups to serve tasty vegan food."}, {"name": "Chem-E-Car Project", "description": "Chem-E-Car Project aims to provide chemical engineering students with the opportunity to participate in a team-oriented hands-on design and construction of a small chemical powered model car. In addition, it helps increase awareness of the chemical engineering discipline among the general public, industry leaders, educators and other students."}, {"name": "Chemistry Peer Advisory League (ChemPAL)", "description": "The mission of  Chemistry Peer Advisory League (ChemPAL) is to provide mentoring to undergraduate students studying Chemistry and opportunities to serve as mentors for graduate students in the Chemistry & Biochemistry Department. The group focuses on supporting first generation undergraduate students and other minority students who are majoring in chemistry, though is not exclusive to those groups. Small mentoring groups matching graduate student mentors with undergraduate mentees meet throughout the academic year to support the undergraduate mentees. Additionally, group-wide quarterly events are hosted to foster community. Other opportunities, such as lab tours and science demos may also be hosted to promote a more collective excitement for chemistry. \r\n\r\nObjectives:\r\nChemPAL seeks to build a welcoming and encouraging community for all undergraduates considering degrees and careers in Chemistry, Biochemistry, or related fields.\r\nChemPAL mentoring groups will help mentees find their confidence and passion in Chemistry & Biochemistry.\r\nChemPAL will help undergraduate students grow a professional network by forging stronger connections to fellow students and graduate students.\r\n"}, {"name": "Chess Club at UCSD", "description": "To promote and encourage chess on campus by creating an intellectually challenging environment by introducing regular chess meetings and tournaments to UCSD. "}, {"name": "Chi Omega", "description": "Chi Omega is a Panhellenic sorority forever committed to its founding purposes of friendship, personal integrity, service to others, academic excellence and intellectual pursuits, community and campus involvement, and personal and career development."}, {"name": "Chicanos/Latinos for Community Medicine at UCSD", "description": "We are a pre-health undergraduate organization that is committed to providing support, guidance, and education in our pursuit for higher education in medicine. Our beliefs are deeply rooted in providing better health care for our underserved communities through service, empowerment, and improving access to culturally-competent health care.\r\n"}, {"name": "Chinese American Student Association", "description": "The Chinese American Student Association’s mission is to provide a setting and a community for all UCSD students with an interest in Chinese and/or Chinese American culture by organizing events that promote and build awareness of Chinese and Chinese American culture."}, {"name": "Chinese Business Society", "description": "The purpose of founding this organization is intended to construct a business society which is to help Chinese students to get more first hand information about their future career paths in the U.S.. The goal of this organization is to construct various network opportunities with professionals who possess specific background in business such as (Finance, Consulting, Accounting and Investment Banking.) in order to obsess abundant first-hand information. We are trying to bound the UCSD alumni circle and maximizing the utilities of it in order to make our graduates have grandiose future.  The organization will do the best to provide networking opportunities with people from different industries, resume workshops, mock interviews, panel discussion, scholar seminars and other activities for students who demonstrates the strong interest in related area.\r\n"}, {"name": "Chinese Christian Fellowship @ UCSD", "description": "To provide opportunities for Cantonese-speaking students to learn about God."}, {"name": "Chinese Christian Gospel Fellowship", "description": "The purpose of Chinese Christian Gospel Fellowship (CCGF) is to spread the Gospel from God into the university community, primarily to those who are Chinese speaking,   but everyone is welcomed. We are to serve the community, and lead people to Jesus Christ through the Word of God – the Bible. "}, {"name": "Chinese Dance Association", "description": "To enrich the student community of UCSD with the awareness of Chinese culture through the art of dance. Our purpose is to create an atmosphere of artistic and creative expression for everyone. CDA practices Chinese dance with emphasis on ballet techniques, but continues to keep the essence of Chinese culture in the pieces. In order to spread multi-cultural acknowledgemnt, CDA uses dance to celebrate the individual creativity and artistic collaboration. "}, {"name": "Chinese Student Association", "description": "To provide service to Chinese International students. Such as airport pick ups.\r\n Help them to fit into American culture. We are going to provide a platform for Chinese students and American students to get to know each other and communicate better. I think it is important because all the other Chinese student Orgs are not doing such events for Chinese Students to fit into American Culture and UCSD campus life."}, {"name": "Chinese Students and Scholars Association", "description": "The Chinese Students and Scholars Association (CSSA) is a non-profit organization at University of California, San Diego. Those UCSD students, postdocs, visiting scholars and their family members coming from People's Republic of China are automatically eligible for membership. As one of the largest student organizations on UCSD campus, CSSA  serves as an important vehicle in enhancing mutual help and affinity among individuals of the local Chinese community. "}, {"name": "Chinese Union", "description": "Promoting Chinese culture and building stronger bond within the UCSD Chinese American community."}, {"name": "Christian Science Organization at UCSD", "description": "The purpose of the Christian Science Organization at UCSD is to promote a practical spiritual perspective to life and campus issues. \r\n\r\nThe objectives of the Christian Science Organization at UCSD, are the following: 1) To hold interactive group meetings where students and faculty can discuss spiritual healings, ideas, insights, and experiences regarding life and campus issues; 2) To bring speakers with a spiritual perspective to the campus to discuss issues of importance to the campus community; 3) To make the book, Science and Health with Key to the Scriptures, by Mary Baker Eddy, and its ideas, as well as other Christian Science literature, available and accessible to the campus community.\r\n\r\nThe Christian Science Organization at UCSD is a non-profit student organization.\r\n"}, {"name": "Christians at UCSD", "description": "To provide Christian fellowship at UCSD"}, {"name": "Circle K. International", "description": "Circle K International is comprised of university students who are responsible citizens and leaders with a lifelong commitment to community service worldwide. Through the three tenets of Service, Leadership, and Fellowship, Circle K inspires people to better our world, following the motto of \"Live to Serve, Love to Serve.\" Circle K provides constructive opportunities for students to become involved on their campuses and communities through service work to others in need. "}, {"name": "Climbing Team at UCSD", "description": "The Climbing Team at UCSD seeks to not only train to compete in the Collegiate Climbing Series sponsored by USA Climbing, but to also promote a healthy lifestyle through rock climbing. The climbing community, both recreational and competitive, is extremely supportive and caring. We wish to strengthen that community within UC San Diego so that it can attract a more diverse student body.\r\n\r\n"}, {"name": "Coaching Corps", "description": "The purpose of Coaching Corps is to provide volunteers to coach sports at low resource communities."}, {"name": "Cognitive Science Student Association", "description": "Aid Cognitive Science student body through academic, professional, and social means;  Engage graduate population and faculty."}, {"name": "Collaboration for Neuroscience", "description": "It is our organization’s philosophy to involve our members in a holistic application of undergraduate neuroscience. Members will have the opportunity to listen to keynote speakers, explore undergraduate research, and improve the San Diego community through neuro-focused academic outreach and local volunteering. Ultimately, we aim to provide the our members with a means to engage neuroscience outside of the classroom.\r\n"}, {"name": "College Democrats at UCSD", "description": "The purpose of the College Democrats, a non-profit organization, is to educate students about the philosophy of the Democratic Party, promote campus discussion of issues of concern to students and the nation at large, foster involvement in political movements and affect political change on a local, state and national level"}, {"name": "College Diabetes Network at UCSD", "description": "Our Chapter of the College Diabetes Network was founded for the purpose of connecting college students with and affected by type 1 and type 2 diabetes in the hopes that these connections will create a support network which will enable students to fulfill their potential and limit the negative psychological and physical effects of diabetes. We also contribute to the diabetes community by fundraising for various diabetes non-profit organizations in San Diego and nationally."}, {"name": "College Republicans at UCSD", "description": "The College Republicans at UCSD strive to enhance principles of the Republican Party in the UCSD community. We encourage the advancement of the Republican Party through aiding elections at all levels of government. Further we promote a forum for political discussion open to all viewpoints. We also seek to serve the UCSD community through various volunteer efforts. The College Republicans at UCSD aims to build leadership abilities in students to serve the community and party."}, {"name": "Colleges Against Cancer", "description": "Colleges Against Cancer is a non-profit nationwide collaboration of college students, faculty, and staff dedicated to eliminating cancer by initiating and supporting programs for cancer education in college communities. We accomplish this through our four strategic directions: Cancer Education, Advocacy, Relay For Life, and Survivorship."}, {"name": "Colors of the Brain", "description": "Colors of the Brain aims to foster a sense of community for underrepresented minority brain scientists. As the organization grows, mentoring collaborations will be arranged with undergraduate research diversity programs. "}, {"name": "Comedy on Campus", "description": "This organization seeks to provide a forum for all aspiring and practicing comedians at UCSD to practice and discuss all things comedy. Specifically, this club will focus on providing a weekly location where any UCSD student can perform their brand of comedy."}, {"name": "Comicbook Club at UCSD", "description": "The purpose of the club is to foster community between comic: creators, artists, writers, readers, and enthusiasts"}, {"name": "Company 157", "description": "Company 157 was created to support the undergraduate theatre cabaret program by providing information, funding, access to tech support, and a network of students, graduates and faculty members."}, {"name": "Computer Science and Engineering Society", "description": "The purpose and aim of the Computer Science and Engineering Society is to provide an opportunity for interested students to investigate the basis of engineering and programming. "}, {"name": "Construction Management Association of America at UCSD", "description": "The mission of the Construction Management Association of America at UCSD is to promote the profession of construction management at UCSD, and to provide students with resources and professional development opportunities in the construction industry."}, {"name": "Cornerstone Community Consultants", "description": "To assist and serve aspiring business leaders by bridging the gap between faith, community, and business opportunities through connections."}, {"name": "Costume Design at UCSD", "description": "Costume Design at UCSD plans to create an environment for students interested in teaching or learning about costume design, props, and cosplay! We welcome any student, regardless of prior knowledge or experience in costume design. The members of the organization will have the opportunity to discuss and brainstorm ideas for individual projects, build essential skills in making costumes and props, contribute to other members’ projects, and enjoy related social events to build a community."}, {"name": "Counseling and Psychological Services Peer Education Program", "description": "The CAPS Wellness  Peer Education Program is a non-profit organization that seeks to provide educational and outreach opportunities to members of the UCSD community and beyond. We recognize the value of peer support in helping students address personal concerns.  Through peer education, we hope to help students recognize their resources as well as increase prevention of mental illness and decrease the stigmas associated with utilizing the Counseling and Psychological Services."}, {"name": "Cubanidad", "description": "We are a group of Latinx students at UCSD invested in learning about Cuba’s educational system, history, and culture. As students, we want to immerse ourselves in their educational system. In comparison to other Latin American countries, Cuba’s educational system is the most effective in terms of student retention and overall performance. The focus on national identity, history and the student-centered pedagogy reflects Cuba’s priority on education and making it accessible to all students. \r\n\r\nMore information about Cuba’s education system and its historical and cultural context is a critical part of ending Cuba’s isolation. Recent U.S. government actions to improve relations between our two countries is a positive step. However, the U.S. economic blockade against Cuba is an injustice that we oppose. Instead, we hope to improve our country’s understanding of Cuba, particularly in effort to decolonize societal structures and relations.\r\n"}, {"name": "Cultural Iranian STudent Association (CISTA) (formerly ISTA)", "description": "to sponsor Persian social and\tcultural activities and events, to promote an understanding of Iranian culture, to help foster friendship among different cultural groups, and to provide a source of union and support for the Iranian community at UC San Diego."}, {"name": "Da Real Punjabiz", "description": "In the 17 years since DRP was formed, the team has performed at numerous competitions including Boston Bhangra, Bruin Bhangra, Dhol Di Awaz, VIBC, So-Cal Bhangra, and Best of the Best. Placing at many competitions, DRP has raised awareness of Punjabi culture not only in Southern California, but all over the United States. Through hard work, dedication, and determination, DRP hopes to continue to spread its love and respect for bhangra for years to come."}, {"name": "Dance Marathon at UCSD", "description": " The purpose of this organization is to engage and empower students and the\r\n community to heighten social awareness by raising funds in a creative, energetic, and fun manner to benefit Rady Children’s Hospital - the largest children's hospital in California. The organization aims to provide students from the University of California San Diego an opportunity to take part in community service and philanthropic events while learning new skills and developing lasting friendships."}, {"name": "Darkstar", "description": "To gather together all those interested in Science Fiction and Fantasy."}, {"name": "Daughters of Triton", "description": "To bring together and create an all-women's acappella group within the UCSD community. To provide students who are interested in acappella music an outlet through performances and/or a group to belong to."}, {"name": "DeeJays and Vinylphiles Club", "description": "To educate and preserve DJ culture and electronic music culture.\r\nTo expose the art behind DJing.\r\nTo produce quality DJs based on talent, individuality, and fundamentals.\r\n\r\n"}, {"name": "Delta Delta Delta", "description": "THE PURPOSE OF DELTA DELTA DELTA shall be to establish a perpetual bond of friendship among its members, to develop a stronger and more womanly character, to broaden the moral and intellectual life, and to assist its members in every possible way. \r\n\r\nIT SHALL ALSO BE THE PURPOSE OF DELTA DELTA DELTA to promote and develop mutually beneficial relationships between the Fraternity and the colleges and universities where the Fraternity has established chapters, to develop qualities of unselfish leadership"}, {"name": "Delta Gamma", "description": "The ladies of Delta Gamma pride themselves on their commitment to fostering high ideals of friendship, promoting educational and cultural interests, creating a true sense of social responsibility, and developing the finest qualities of character."}, {"name": "Delta Lambda Phi", "description": "1)\r\nTo develop dignified and purposeful social, service, and recreational activities for progressive men, irrespective of sexual orientation;\r\n\r\n2)\r\nTo lead in determining the rights and privileges of individuals in society; and,\r\n\r\n3)\r\nTo present a strong and positive image which respects the diversity of all individuals, irrespective of sexual orientation."}, {"name": "Delta Sigma Pi", "description": "Delta Sigma Pi is a professional fraternity organized to foster the study of business in universities; to encourage scholarship, social activity and the association of students for their mutual advancement by research and practice; to promote closer affiliation between the commercial world and students of commerce, and to further a higher standard of commercial ethics and culture and the civic and commercial welfare of the community.\r\n\r\n"}, {"name": "Design at UCSD", "description": "To create and foster an interdisciplinary community of human-centered design-minded students, including those interested in Cognitive Science, User Experience, Interaction Design, Human Computer Interaction, Ubiquitous Computing, and Design Thinking in general. To provide workshops, lectures, a design space, support for design competition entries, networking opportunities, and real-world projects for those interested in the aforementioned fields; to be a vehicle to propel students in the direction of their respective goals, whether they be to enter industry, pursue academia, or to just learn more about design; and to forge/maintain connections with alumni, local communities, and companies. "}, {"name": "Design, Build, Launch", "description": "The American Astronautical Society and American Institute of Aeronautics and Astronautics have organized an annual student design-build-launch competition for space-related topics. CanSat is an annual competition that requires each team to design, build, and launch a payload/deployment system that will satisfy a set of challenging mission requirements. The Design, Build, Launch (DBL) team at UCSD strives to further each member's understanding of engineering topics and deepen their passion for engineering. We are a small project, where each member's contributions will be recognized and valued. We aim to build the best cansat with hands-on expertise and self-taught technical knowledge. "}, {"name": "Design/Build/Fly", "description": "The American Institute of Aeronautics and Astronautics hosts an annual Design/Build/Fly competition for universities to design and build a plane that best meets the unique goals and rules for the year.\r\n\r\nThe UCSD DBF team seeks to gather interested students to cultivate their knowledge of the design and build techniques for model airplane flight. In doing so, participants will be part of an entire project team, learning the engineering work ethics and design processes required to see ideas through to success. \r\n\r\nThis is a very hands-on project and provides a medium for students to apply their knowledge and passion towards.\r\n\r\n"}, {"name": "Duly Noted", "description": "To provide a supportive environment in which singers can enjoy and participate in musical activities, specifically vocally. "}, {"name": "ECE Undergraduate Student Council", "description": "The ECE Undergraduate Student Council (USC) is the voice of Electrical and Computer Engineering (ECE) undergraduate students at UCSD. Through networking, programming, leadership, & relevant education, the council strives to effect change within the department & campus at large, building a stronger & longer-lasting community for current & future engineers. The USC is committed to carrying out ECE’s mission statement of educating tomorrow’s technology leaders."}, {"name": "Ecology, Behavior & Evolution Club at UCSD", "description": "The Ecology, Behavior & Evolution Club at UCSD seeks to provide students with research opportunities, internship guidance, and information regarding careers in ecology, behavior & evolution (EBE).  The group also serves as a social nexus for students with EBE interests, and provides an organizational structure to promote volunteer activities."}, {"name": "EducationCorps", "description": "To recruit and train UCSD students to serve as volunteer tutors and mentors to K-12 students in San Diego communities that are underserved. This program aims to establish and maintain partnerships with local schools and community based organizations. We seek to promote a college-going culture, better attitudes toward school, and an increase in academic performance."}, {"name": "Emergency Medical Services at UCSD", "description": "Emergency Medical Services at UCSD (EMS at UCSD) is organized exclusively to educate, provide resources, and positively impact the UCSD community by raising awareness of Emergency Medical Services. "}, {"name": "Energy Club at UCSD", "description": "The Energy Club seeks to build a community of students and professionals to analyze and understand the most pressing global energy challenges. To accomplish this we will focus on interdisciplinary programs to bring together members of the engineering, science, policy and business communities. Through these events we hope to provide members with a well-rounded, extensive knowledge of the issues and application of the energy landscape and foster potentially unique solutions. "}, {"name": "Engineering World Health", "description": "Engineering World Health designs, provides, and maintains appropriate medical technology for developing nations. We accept students from all majors and walks of life who share our passion for improving global healthcare."}, {"name": "Engineers for a Sustainable World", "description": "ESW-UCSD’s Vision: We envision a worldwide era of sustainability in which all communities cooperate to achieve lasting environmental, social, and economic prosperity.\r\n \r\nESW-UCSD’s Mission: Our mission is to bring communities together to develop, implement, and share sustainable technologies and practices worldwide.\r\n"}, {"name": "Engineers Without Borders at UCSD", "description": "Engineers Without Borders--UCSD Chapter is a non-profit organization dedicated to the betterment of developing communities around the world through the design, implementation, and construction of sustainable projects that fit the need of the community. Our goal is to establish an on-going relationship with these developing communities and to teach them the necessary skills to maintain the facilities and structures that we leave them with."}, {"name": "Entrepreneur Challenge", "description": "The purpose of the UC San Diego Entrepreneur Challenge is to encourage the development of promising ideas and technologies into value generating enterprises. The competition brings together multi-disciplinary teams of engineers, scientists, and business-minded students with local area entrepreneurs and professionals. "}, {"name": "Eta Kappa Nu ( HKN)", "description": "Eta Kappa Nu (IEEE-HKN) is the student honor society of IEEE and is dedicated to encouraging and recognizing excellence in IEEE fields of interest. Members consist of students, alumni, and professionals who have demonstrated exceptional academic and professional accomplishments. Student members are selected on the basis of scholastic standing, character, and leadership.  At UCSD, HKN provides free tutoring and hosts a variety of workshops and events to promote technical, professional, and academic development."}, {"name": "Eurasian Student Association", "description": "Introduce members of the UCSD community to the elements of Russian/Eastern European/Central Asian cultures, art and history. Form a community of people who share a common background and similar interests and people who are interested in learning about these cultures. \r\n"}, {"name": "Evangelical Chinese Christian Fellowship", "description": "ECCF is an on-campus Christian fellowship focusing on the Mandarin speaking community in UC San Diego. Our fellowship is a group of brothers and sisters supporting each other physically and spiritually while studying in UCSD and we are here to build a home away from home together through the love of Christ."}, {"name": "Eve", "description": "Eve primarily exists to provide an environment to learn about information security.\r\n\r\nEve also provides social opportunities for students sharing an interest in information security, and promotes awareness of information security."}, {"name": "Falun Dafa", "description": "Falun Dafa is an ancient meditation practice in the Buddha school tradition; at the core of the practice are the values of Truthfulness, Compassion and Forbearance, which act as a guide for daily life and practice. Through tranquil meditations and an emphasis on the elevation of one’s heart-mind character, Falun Dafa has brought health and well-being to more than 100 million people in 100 countries around the world. Falun Dafa is not a religion, there is no membership and is completely free of charge! It is a mind-body practice with a spiritual component that covers metaphysics, ethics and enlightenment. Through persistent practice one strives to achieve a state of selflessness, increased insight, inner purity, balance- true health and ultimately enlightenment. Since July 1999 the communist government of China has persecuted and enslaved millions of innocent people for practicing Falun Dafa and they comprise 65% of labor camps, detention centers and prisons across China for believing in Truth- Compassion- Forbearance. Evidence from acclaimed sources have proven tens of thousands of Falun Dafa practitioners to have been killed from live organ harvesting for China’s lucrative organ transplant market. So what do we, as an organization, do on campus? We meditate together and teach the exercises, promote cultural art events that revive traditional Chinese culture and raise awareness about the persecution and organ harvesting of Falun Dafa practitioners in China."}, {"name": "Feminist Book Club", "description": "Our purpose is to learn about feminist theory through the writings and literature of feminist scholars. The Feminist Book Club will serve to open up a dialogue about intersectional feminism, covering a wide range of topics, including, but not limited to: race, gender, sexuality, class, ability, and ethnicity. This club will be an inclusive, safe space for all participants."}, {"name": "Figure Skating @ UCSD", "description": "We compete in the Intercollegiate circuit throughout the school year. One of our main goals is to qualify for Intercollegiate Nationals as a team. Each skater performs individually in the level and event of their choosing and the points they earn from podium placement get added to the UCSD cumulative team score. Intercollegiate competitions are a great place to have a fun time and meet skaters from other schools throughout the country. \r\n\r\nOur team is tight knit on and off the ice. Practices are largely self scheduled figure skating is a sport driven by individual motivation to improve. However, members often carpool to practice help one another with jumps, spins, and choreography. "}, {"name": "Finesse Dance Company", "description": "Our purpose is to provide an outlet for dancers who come to college seeking to continue their passion for dance in addition to pursuing higher education as UCSD does not offer this. Our contemporary based dance company will hold various showcases/events to allow our members to express themselves through artistic movement. Our main goal is to offer an escape for students who wish to further build upon their talent and creativity, as well as forming a united family."}, {"name": "Flying Sams", "description": "Flying Sams is a medical service club at the University of California, San Diego in association with the non-profit service organization, The Flying Samaritans Inc. We are dedicated to providing free medical services to the underprivileged people of Mexico through a clinic staffed entirely of volunteer physicians, nurses, medical and pre-medical students."}, {"name": "Food Recovery Network at UCSD", "description": "Food Recovery Network will work to create a food recovery program to help divert food waste and feed the hungry in San Diego. We will work with the Triton Food Pantry, helping collect and retrieve food. We will also commit to educating the public on food waste and hunger in the U.S."}, {"name": "FOOSH", "description": "Foosh performs and teaches short form and long form improv comedy. Throughout the year we regularly put on free shows for the UCSD student body, perform in the greater San Diego improv community, and host and attend improv festivals."}, {"name": "Foster the Students", "description": "The primary purpose of Foster the Students is to advocate on behalf of foster youth and promote awareness of the foster youth system. We aim to give back to the community through volunteer work with foster youth and low-income students in the area. Above all, we want to create a safe environment not only for foster youth but also neglected students who felt that they did not or do not received adequate familial support. "}, {"name": "Fronteras Saludables (Healthier Borders)", "description": "Fronteras Saludables (Healthier Borders) is student organization that hopes to spread awareness about health issues in Tijuana, Mexico. We will support the efforts of the HFiT free clinic (located in Mexico) through fundraising for medical supplies, medications, and other equipment. Fronteras Saludables (Healthier Borders) will inform UCSD undergraduates about opportunities to get involved in the HFIT internship program and other supporting roles. "}, {"name": "Fun Talk & Learn Chinese Student Association (TLCSA)", "description": "Fun Talk & Learn Chinese Student Association is a student body helping UCSD students learn useful skills, form appropriate worldviews in order to live a meaningful life and be contributive to the society inside and outside the campus.\r\n\r\nThrough workshops and seminars, students will be equipped with capabilities to analyze, to conclude, to present and to lead.\r\n\r\nThrough connecting with local Chinese/Taiwanese people, students can obtain helps in dorm and off-campus living while attending UCSD.\r\n\r\nStudents will learn to overcome the challenges from the cultural and language differences in order that they can focus on the academic works without much hindrance from daily life arrangement.\r\n\r\nGroup activities will be organized primarily by the students in order for them to learn the skills for planning, execution and leadership. \r\n\r\nBesides successfully academic learning, students can gain the spiritual understanding and find good mentors who can help them using their native languages.  \r\n\r\nStudents will also be given training on career development such as writing resumes, conducting successful on-site job interviews, and learning to work with others.\r\n\r\nStudents are encourage to evaluate their world views in order to live with impact!\r\n\r\nThe goals are that the participants will be able to obtain :\r\n1.\tCommunication and presentation skills both verbally and in writing\r\n2.\tInnovative view on spiritual and religious issues\r\n3.\tUnderstanding of the global affairs based on facts.\r\n4.\tConnections with local Chinese/Taiwanese people and students\r\n5.\tLeadership through organizing activities\r\n6.\tCareer development skills\r\n7.\tEnthusiasm for life that leads to contributions to the community"}, {"name": "FUSION Hip-Hop Dance Events Association", "description": "The FUSION Hip-Hop Dance Events Association is a student organization involved in the cultural, social, community, and academic projects that benefit its members, its campus, and its community. The goal of FHHDEA is to educate and celebrate the unique Asian American cultural identity and its major presence in the emerging hip-hop dance communities along the west coast at UCSD. FHHDEA aims to recognize excellence in the UCSD hip-hop dance community, west cost dance communities, support dancers, and provide performance opportunities for dance to be shared among dancers and audiences all over the nation and beyond."}, {"name": "Game Development Studio", "description": "The purpose of the club is to provide a semi-professional environment for students of all fields to get experience in working on a project in hopes of encouraging entrepreneurship, gaining experience in teamwork, exposing members to applications of creative game development and design, and developing skills of all fields by applying school lessons to a real-world product."}, {"name": "Gamma Zeta Alpha Fraternity Inc", "description": "The mission of Gamma Zeta Alpha Fraternity, Inc., a not-for-profit corporation built on the foundation of respect and brotherhood, is to establish and promote a nurturing environment at the university level and beyond, through academic excellence, community service, and the celebration of the diverse Latino Culture."}, {"name": "Gates Millennium Scholars Association at UCSD", "description": "To create a campus-based community among Gates Millennium Scholars."}, {"name": "General Store Co-op", "description": "We are a student-run, nonprofit cooperative. We sell products to students at low prices."}, {"name": "Germain Society", "description": "The specific purpose of this organization is to provide financial support through scholarships for women pursuing higher education in Science, Technology, Engineering, and Math(STEM), as well as to promote awareness of the issues of women in STEM. \r\n"}, {"name": "Global Business Brigades at UC San Diego", "description": "Global Business Brigades aims to improve communities in developing regions of the world. The organization coordinates fundraising events to sponsor delegations to developing nations. These delegations will work with local communities to set up sustainable business processes, empowering them through skills such as financial resource allocation, banking system management, and loan securement for small enterprises. The organization also seeks to foster a culturally aware and practically informed membership in order to provide the greatest possible positive impact."}, {"name": "Global China Connection", "description": "Global China Connection (GCC) recognizes the increasing integration of economies and communication worldwide, especially in America and China. We hope to not only educate our peers to be aware of these increasing ties but also promote the cooperation between these different cultures. Moreover, we want to introduce opportunities for American and Chinese students to jointly experience and explore the vast possibilities of collaboration between the super powers of the world."}, {"name": "Global Development Council", "description": "The mission of the Global Development Council is to help students aware the importance of Global Development to self development, and thus foster the comprehensive development of students. We provide academic workshops about Global and local issue and and help students understand the society as a whole. Also we operate our official accounts on public platforms, writing and posting the essays which advocate the global development. We also hold networking event with alumni or the successful people, in order to help students reach self development while being aware of global development.  Global Development Council also focus on the connections with other organizations or companies. We hold workshops or write journals or have GBM together with other organizations in order to fulfill our global mission. Global Development Council is an non-profit organization. \r\n"}, {"name": "Global Medical Brigades", "description": "Global Medical Brigades (GMB) is a secular, international network of university clubs that travel to developing countries to perform health care in communities without access to medicine otherwise. GMB delivers a holistic model for sustainable health through rigorous needs assessments, sponsoring referrals to those with needs beyond our capacity, keeping accurate electronic patient records, and working to improve the water and overall public health infrastructures of the villages we serve."}, {"name": "Global Medical Missions Alliance", "description": "Part 1. Leave a positive and profound impact for Christ by guiding and equipping students with training and networking opportunities so they may serve as effective healers and ministers of Christ’s love. \r\nPart 2. Foster a unique community and fellowship among peers and mentors committed to medical mission and healing ministry.\r\nPart 3. Become the next generation of healthcare professionals “poured out as a drink offering” for the Gospel.\r\nPart 4. To provide various Medical Mission opportunities around the globe with the main focus, to further God’s kingdom. "}, {"name": "Global Medical Training", "description": "Global Medical Training (GMT) is an international, non-profit, and humanitarian organization that provides free medical, dental, and veterinary services in developing communities in parts of Central America and Mexico. Students are given the unique chance to directly participate in “hands-on” diagnoses and treatments under the supervision of medical professionals. This is the reason why our motto is “LEARN BY DOING.”\r\nAs a health-focused organization, our main purpose is to increase awareness of the lack of healthcare in third world countries by giving undergraduate students the chance to expand their understanding of life and medicine outside the United States. This is made possible by educating and exposing students to the prevalent global and medical issues that many underserved communities in developing countries face. Such issues include poverty, poor national health-care systems, and the various circumstances that contribute to and perpetuate a specific population’s situation.\r\nGMT also understands there are major health issues that reside right in our own community. It is this very reason why we also offer our students the opportunity to volunteer in various community service events including free health fairs servicing the underprivileged in the Los Angeles and surrounding counties.\r\nAltogether, GMT views student volunteers as a vital force for change.  After all, they may be the next generation of health-care providers."}, {"name": "Glory Church Campus Fellowship", "description": "The mission of this organization is to promote the Gospel of Jesus Christ, to promote faith in the Trinity God and His Bible, and to promote love and peace within communities with voluntary services.\r\nThis organization strives to build a fellowship within the walls of UCSD and to meet the spiritual needs of local Christians at UCSD.\r\nAll the actions of this organization will be bounded by the Bible, the constituion and any orgainization regulation of UCSD.\r\n"}, {"name": "Go/Baduk/Weiqi Club", "description": "To promote the growth of Go/Baduk/Weiqi at UCSD and to offer a safe and fun place to play Go/Baduk/Weiqi. "}, {"name": "Grace City at UCSD", "description": "Grace City at UCSD seeks to offer a not-for-profit, church-sponsored Bible study and gatherings for UCSD students with Gospel-centered teaching and application. Its mission is to equip college students with the Gospel for everyday life both on and off campus. "}, {"name": "Graduate Bioinformatics Council", "description": "The objective of the Graduate Bioinformatics Council (GBIC) shall be to represent and advance the career, community, and outreach interests and objectives of the students of the Bioinformatics and Systems Biology (BISB) and Biomedical Informatics (BMI) PhD programs, and to participate in volunteer educational events at local, national, and international levels."}, {"name": "Graduate Christian Fellowship", "description": "GCF exists to help academics in the San Diego community on the lifelong journey of understanding and growing closer to God. "}, {"name": "Graduate Society of NanoEngineers", "description": "Our mission is to represent the collective interests of the student body of graduate nanoengineers and to foster the professional, academic, and social development of nanoengineering graduate students by working with the UCSD Department of NanoEngineering to provide 1) opportunities for grads to build relationships and network with other graduate students, department faculty and alumni, and members of industry, 2) resources to help new students transition smoothly to graduate school both academically and socially, and 3) programs that help graduate students to work beyond the lab and participate in outreach events. GSN at University of California, San Diego aims to work at the interface between the graduate student body, the department administration, faculty, and staff, and the local and professional community, acting as a liaison between these parties."}, {"name": "Graduate Women in Science and Engineering (GradWISE)", "description": "To address issues important to graduate women in science and engineering in a supportive environment and promote programming on topics of interest to said group"}, {"name": "GradWIC", "description": "The objective of GradWIC shall be to foster an innovative, informative and comfortable environment to advance the interests and address the concerns of women graduate students in Computer Science and Engineering at University of California, San Diego."}, {"name": "GreekLove", "description": "Our Purpose is to reach the Greek Community and give them the opportunity to discuss and learn about spiritual things, and provide them with a Christian Community."}, {"name": "Groundwork Books Collective", "description": "A political collective and non-profit bookstore working toward social change to enable people to take control over their own lives. "}, {"name": "GROW UCSD", "description": "Grow UCSD will provide a forum for the collaboration of student gardens on campus. This will include opportunities for students to get involved with existing gardens, as well as educational, social, and research opportunities."}, {"name": "Harmony Club", "description": "Harmony Club aims to provide a platform for people to share the beauty of their cultures, faiths and philosophies. This club aims to create and develop positive social connections within and between disparate values and diverse communities in order to achieve mutual understanding, tolerance and enriching positive social atmosphere. "}, {"name": "Hawaii Club", "description": "A.\tPromote cultural awareness of Hawai’i, other Polynesian Islands, and their people.\r\nB.\tSpread the “Aloha Spirit” across the UCSD campus.\r\nC.\tServe as a support group for incoming students from Hawai’i and other Polynesian Islands.\r\nD.\tProvide a social haven for any UCSD student seeking friends.\r\n"}, {"name": "Health and Medical Professions Preparation Program (HMP3)", "description": "The UCSD Health and Medical Professions Preparation Program (HMP3) provides undergraduates with enriching experiences that will enhance their preparation for admission into professional school in the medical and other health professions. Through collaborations with the UCSD School of Medicine, faculty, community health care providers and others, HMP3 provides members with stimulating experiences designed to expand the mind and increase qualifications for entry into the health professions. HMP3 a"}, {"name": "Healthcare Opportunities Preparation & Empowerment (HOPE)", "description": " Healthcare Opportunities Preparation & Empowerment at UCSD serves to assist underrepresented minority, first-generation, or financially disadvantaged students  become more aware of the various fields of healthcare available to them. \r\n"}, {"name": "Healthcare Policy and Debate", "description": "Healthcare Policy and Debate is a non-profit organization that functions as a platform upon which undergraduate students learn about the policy aspect of the healthcare sector and hone in on how it impacts health care receiving populations in the U.S. and around the globe. The organization is run in the form of a quarterly journal in which new health policy research is summarized and student opinions are presented in the debate section. The journal ultimately culminates in an end of the year staged debate involving the most popularly debatable issues of the year."}, {"name": "Hellenic Student Association", "description": "a. To promote fellowship among members of the UCSD Hellenic community through cultural, social, athletic, and educational activities.\r\n\r\nb. To welcome and counsel all incoming students of Hellenic origin.\r\n\r\nc. To foster an understanding and appreciation of Hellenic culture among members of the UCSD community.\r\n\r\nd. To facilitate communication between its members and UCSD officials, other student groups, and Hellenic organizations worldwide.\r\n\r\ne. To promote fellowship between people of Hellenic heritage and people interested in the Hellenic culture.\r\n"}, {"name": "Hermanas Unidas de UCSD", "description": "Hermanas Unidas is a Latina based organization that focuses primarily on academics, community service, and collegial networking. \"Poder de la Mujer\" is what all Hermanas strive to embody, both as individual women and as an organization. The motto symbolizes the strength and will of each and every Hermana in their quest for higher education, the empowerment of their families and communities, as well as equality in education, the workplace and the rest of society."}, {"name": "Hermanos Unidos de UCSD", "description": "Hermanos Unidos de UC San Diego will strive to create a welcoming and empowering brotherhood or “hermandad” amongst its members. Hermanos Unidos de UC San Diego will strive to attain this goal by embracing the three foundational pillars, which are stated in the Hermanos Unidos Constitution.\r\n\r\n“The three foundational pillars of Hermanos Unidos are Academic Scholarship, Community Service, and Social Networking. Academic Scholarship reflects the primary reason why an Hermano attends an institution of higher learning: to receive a quality education. Community Service represents an Hermano’s commitment to community involvement. Social Networking will seek to make the transition from high school/ community college to undergraduate life less traumatic and more meaningful for incoming Hermanos. Fulfilling the three pillars leads to the development of partnerships and alliances necessary for successfully accomplishing the mission of Hermanos Unidos. Thus, all three pillars should be approached with equal amount of concern, time, and intensity”\r\n-HU Constitution."}, {"name": "HMP3 Peer Mentor Program", "description": "The HMP3 Peer Mentor Program is designed to provide its members with unique community service opportunities, career advice and insight, and valuable mentoring experiences. It is meant to foster professional relationships that will lead to academic and career-based success. This cooperation amongst undergraduate peers will eventually lead to a greater solidarity and intellectual camaraderie in the UCSD community. "}, {"name": "HMP3 Program", "description": "Program of the Health and Medical Professions Preparation Program (HMP3)  concentrates on organizing events that prepare, inform and assist students pursuing the health professional school of their choice."}, {"name": "HMP3 Service", "description": "Our organization is a branch of HMP3 (Health and Medical Professions Preparation Program) that is concerned primarily with providing our members, students who are interested in medical or health-related professions, with opportunities to become involved in community service in the form of volunteering and fundraising events. "}, {"name": "HOLOS : Healing Our Lives of Stress", "description": "\tThe purpose of HOLOS is to explore in depth various healing and restorative practices native to a variety of cultures from around the world in order to provide students with alternative methods of stress management and maintenance of overall well- being. "}, {"name": "Homeless Charter, The", "description": "The purpose of The Homeless Charter is to hand out food to the homeless in San Diego.  The organization seeks to promote weekly service to the greater community of San Diego, unity within the student body of UCSD, and awareness on the issue on feeding/sheltering the homeless.  \r\n\r\nThe Homeless Charter is a non-profit student organization.\r\n"}, {"name": "Hope Church of San Diego", "description": "To be a family of servants to God"}, {"name": "Imports@UCSD", "description": "As a car club at the University of California, San Diego, Imports@UCSD aims to build a community for car enthusiasts to gather and share their collective knowledge about automobiles and motor sports. Our goals include teaching members about various aspects of automotive knowledge while constructing a network to develop strong connections in the automotive industry. We also strive to create a safe environment where we can test and improve the performance of our cars as well as our driving skills. Highly discouraging street racing, Imports@UCSD gives members the opportunity to go to the race track to satisfy their high performance driving needs. Using all of these resources and connections, members of Imports@UCSD can become strong leaders who are extremely knowledgeable in the automotive field and enthusiastic about everything they do. Even the slightest passion for cars will not be overlooked and is all that one must posses to become a proud and capable member of Imports@UCSD."}, {"name": "Include Autism at UCSD", "description": "The purpose of this organization is to volunteer with young adults with disabilities in the San Diego area to help them learn real-world functional skills, establish the understanding and acceptance of differences, build genuine friendships, and make a significant social impact for local youth with intellectual and developmental disabilities (IDD)."}, {"name": "Indian Student Association", "description": "This organization is to help all incoming students from India and of Indian origin or descent to adapt to life at UC San Diego and the city. Its purpose to strengthen the Indian community present on campus and also propagate our culture and increase the awareness about our culture to everyone. "}, {"name": "Innovative Student Project Groups", "description": "ISPG is a student run organization which aims to give students confidence to start and work on projects outside the classroom. With discussions on leadership, idea sessions , project group workdays, and workshops,  members will gain technical skills and knowledge about designing and managing projects effectively. "}, {"name": "Insight Pre-Optometry", "description": "To provide UCSD students interested in the field of optometry with the information, support, and opportunities necessary to learn about the profession, the schools of optometry, and the application process. "}, {"name": "Institute of Electrical and Electronics Engineering (IEEE)", "description": "To build technical skills, professional skills, and social connections by applying engineering outside the classroom."}, {"name": "Inter Varsity Christian Fellowship", "description": "To establish and advance a witnessing community of students and faculty who follow Jesus as Lord and Savior: growing in love for God, God's word, God's people of every ethnicity and culture and God's purpose."}, {"name": "Inter-College Residents' Association (ICRA)", "description": "To plan social, cultural, and educational events for residents for all seven residential areas."}, {"name": "Inter-Sustainability Council", "description": "Working to enhance the impact and efficiency of the sustainability community on campus, the Inter-Sustainability Council represents and connects various on-campus sustainability entities in order to increase awareness and education of sustainability and provide sustainable solutions that will maintain UC San Diego’s position as a leader in sustainability in the country and the world."}, {"name": "Interaxon at UCSD", "description": "To provide underserved public schools (K-12) in San Diego County with interactive and educational activities/presentations about neuroscience and to foster interest in higher education and learning."}, {"name": "Interfraternity Council", "description": "The purpose of this body shall be to govern the member fraternities, to promote intellectual, philanthropic, fraternal and social values of the fraternities at the University of California, San Diego, and to maintain cooperation between these fraternities, their respective international headquarters, alumni, and the surrounding community."}, {"name": "Intermission Orchestra", "description": "The Intermission Orchestra  is a student-run, student-managed and student-directed music ensemble that aims to provide student composers with an opportunity to orchestrate, compose for,  and direct an ensemble, and for student performers, of all levels, who wish improve their performance techniques by learning from each other in a relaxed environment and perform music recreationally.  We are mainly a social group that seek to further our respective areas of interest while enjoying our time together performing in the ensemble.\r\nOur pieces will range from classical chamber and orchestral music to video game and film music, all arranged for the specific ensemble and instruments at hand."}, {"name": "International Christian Fellowship-West", "description": "In response to God's love for all people, we are here to establish student-led international witnessing communities, which welcome international students and scholars."}, {"name": "International Health Collective", "description": "     The International Health Collective (or IHC) is a UCSD student-run non-profit organization that establishes a temporary free clinic in communities that need medical help around the world.  Our first and primary goal is to assist underprivileged communities with free medical care, medicine, and health education to improve the prevalent illnesses seen in underdeveloped communities.  Our secondary goal at IHC is to provide undergraduate students with the resources necessary to pursue their interests in the health care.  These resources include first-hand experience in a public medical setting by personally assisting medical professionals. They also include seminars in which medical professionals of all specialties speak on personal experiences encountered in their field to give attendees choose which specialty to work toward.  \r\n     The International Health Collective serves the communities surrounding a temporary clinic site in Tijuana, Mexico, which functions during three Saturdays per school quarter. IHC strives to diagnose, supply medication, and provide health education to members of the Tijuana community with free doctor consultation, pharmacy care, and seminars. To provide these efficiently and effectively, IHC utilizes passionate staff members, comprehensive medical recording systems, and an efficient clinic layout.  By coordinating emergency medical technicians, pharmacists, and medical doctors, as well as UCSD student volunteers, the entire staff of IHC is able t"}, {"name": "International QLGBT Union at UCSD", "description": "In order to support and accommodate international students who identify as queer/transgender, we are creating International Queer Union at UCSD. While loving our amazing LGBT Resource Center on UCSD campus, some of the queer/transgender-identified international students, who have been to their events/programs, have recognized the necessity of a safe space specifically designed for queer/transgender-identified international students. As our experiences/observations tell, it is significantly challenging for queer/transgender-identified international students to blend into queer/transgender-identified domestic students, especially at quarterly/annual/single-day events/programs, due to cultural and language barrier. Therefore, our main goals are, 1) to provide a safe space where queer/transgender-identified international students can comfortably connect to each other 2) to bridge domestic and international queer/transgender students by reducing the cultural/language barrier. Domestic students who are interested in knowing international queer/transgender students and learning their issues will be invited as a part of our organization as well. Thus, IQU will primarily be a social group, and our programs/events will be designed accordingly."}, {"name": "International Society of Pharmaceutical Engineers (ISPE)", "description": "Our purpose is to bring professional development to students in the pharmaceutical, biotechnological, and related industries. Thus our members will be offered resume/interview building workshops, networking events with industry professionals, industry tours, discussion panels, and much more. "}, {"name": "International Studies Student Association (ISSA) at UCSD", "description": "The International Studies Student Association (also: ISSA) is the official student organization of the International Studies Program (ISP) Department at the University of California, San Diego. The organization gathers like-minded individuals who share diverse interests in international studies and international relations. ISSA intends to provide a platform of rich experiences and opportunities in international studies."}, {"name": "IUSM (International Undergraduate Student Ministry)", "description": "We are a fellowship that strives to build a Christ centered community on campus, primarily with International undergraduate students, but everyone is welcome. We meet weekly for Bible studies & prayer and worship on campus on Sundays. Our vision is to share the gospel and students to spiritually thrive during college."}, {"name": "Jacobs Graduate Student Council", "description": "Our organization's goal is to promote a sense of community and increase student involvement among the Jacobs School of Engineering Graduate Students."}, {"name": "Jacobs School Scholars Society", "description": "To promote camaraderie and a sense of community among recipients of the UCSD Jacobs School Scholarship."}, {"name": "Japanese Student Association (JSA)", "description": "We are a non-profit Japanese-interest cultural organization, which brings together 50+ members for Japanese-related social, cultural, career information and community events. We communicate with our members in both English and Japanese.\r\n\r\n"}, {"name": "JDoe at UCSD", "description": "To combat sexual assault on UCSD’s campus and in the Greater San Diego region by assisting JDOE, PBC, a public benefit corporation, which strives to build a community that fights against sexual assault."}, {"name": "Junior Panhellenic", "description": "To assist Panhellenic Council in overseeing the 11 Panhellenic and 1 Affiliate Chapters within the Panhellenic Council. These chapters are: Alpha Chi Omega, Alpha Epsilon Phi, Alpha Omicron Pi, Alpha Phi, Chi Omega, Delta Delta Delta, Delta Gamma, Kappa Alpha Theta, Kappa Kappa Gamma, Phi Sigma Rho (Affiliate), Pi Beta Phi, and Sigma Kappa."}, {"name": "Kabayanihan", "description": "To retain Filipino language at UCSD, continue community outreach, promote Philippine Studies, preserve culture and language, and improve intergenerational relations."}, {"name": "Kaibigang Pilipin@", "description": "To provide a space in which people can learn, share, educate, and appreciate Pilipino/a culture."}, {"name": "Kairos Christian Fellowship", "description": "We are a nonprofit Christian organization that will be established to help the Christian students at UCSD further their knowledge of Jesus Christ to serve their campus community."}, {"name": "Kamalayan Kollective", "description": "To raise consciousness concerning Pinay/Pinoy, Pilipin@ American community issues, and to provide a safe, comfortable, and supportive space for everyone. "}, {"name": "Kappa Alpha Theta", "description": "Yesterday, today, and tomorrow, Kappa Alpha Theta exists to nurture each member throughout her college and alumnae experience and to offer a lifelong opportunity for social, intellectual, and moral growth as she meets the higher and broader demands of mature life.\r\n"}, {"name": "Kappa Kappa Gamma", "description": "To build and provide bonds of friendship, mutual support, respect for intellectual development, and an understanding and allegiance to positive ethical principles."}, {"name": "Kappa Psi Pharmaceutical Fraternity", "description": "The primary purpose of Kappa Psi is to focus on health professions, specifically pharmacy, as a field of study and career. Our purpose is also to join our members for a lifetime of service to their communities as well as provide quality friendships during school and in the future. We would like to use the resources available through our school to aid us in providing health-oriented services and information to our community by hosting outreach events. "}, {"name": "Kappa Sigma", "description": "A non-political, non-religious and non-profit social organization commited to the embodiment of Fellowship, through brotherhood; Leadership, inside and outside of our organization; Scholarship, by aiding scholastic excellence; and Service, by aiding those at our university, in our community, and in the world through community service and philanthropy in order to become better men"}, {"name": "Kappa Zeta Phi", "description": "To provide an opportunity for long lasting friendship and sisterhood to develop the individual in the areas of wholesome attitudes and ideals. "}, {"name": "Kendo Club at UCSD", "description": "The Kendo Club at UCSD seeks to promote awareness and appreciation of the Japanese sport of kendo, through community outreach, school involvement, and intercollegiate competition. "}, {"name": "Kidz Next Door", "description": "Mission Statement: Established in 2014, Kidz Next Door is an exhibition hip-hop dance group based in UCSD. Created with the purpose to inspire others in the dance community, the group spreads their passion for dance through performances and workshops. Although the group's focus is built around the style of hip hop, many diverse styles and backgrounds are represented through the individual dancers such jazz, contemporary, salsa, etc. The Kidz Next Door Leadership pushes the group members to grow not only as dancers but as a family, encouraging them to respect one another as well as the community around them."}, {"name": "Koala, The", "description": "To lighten the mood of the studentry through unabashed humor at all angles"}, {"name": "Kojobs at UCSD", "description": "Connecting between companies and students so students could find jobs easily for their future. "}, {"name": "Kommon Society", "description": "Kommon Society is a student organization for Korean and Korean-American undergraduate students with social science majors. Kommon Society aims to: 1) establish an academic environment among Korean and Korean-American students with Social Science majors; 2) facilitate a mutually beneficial network among students with same majors and career goals; 3) provide opportunities for various academic and professional experiences to prepare each individual's future; and 4) promote interest in contemporary global issues throughout the campus. "}, {"name": "Korea Campus Crusade for Christ (KCCC)", "description": "To help further the Great Commission at UCSD by making disciples and equipping them with the skills necessary to live out a Christian life after college. Activities will include bible study, worship sessions, and morning prayers. "}, {"name": "Korean American Campus Mission", "description": "To obey the Great Commission by discipling and mobilizing Collegians. "}, {"name": "Korean American Scientists and Engineers Association - Young Generation", "description": "KSEA-YG stands for Korean American Scientists and Engineers Association - Young Generation.\r\n\r\nOur parent organization was first established in 1971 to promote international cooperation between scientists and engineers in Korea and the US by providing career development and community service opportunities in the areas of science, technology, and entrepreneurship. More information about our parent organization can be found on the web: www.ksea.org.\r\n\r\nAs a student chapter of KSEA, our organizatio"}, {"name": "Korean American Student Association", "description": "To unify and empower the Korean American voice on campus by means of cultural, political, and social events."}, {"name": "Korean Athletic Network (KAN)", "description": "The United Korean Athletes Association at University of California, San Diego is a nonprofit student organization that promotes healthy interactions among Korean students through the following measures: (1) promotion of athletic activities including but not limited to basketball, soccer, and even traditional Korean activities such as Ssireum (2) directly and indirectly assisting their needs in the purpose of aiding students' adaptation to the new environment. These two central measures will bring about a sense of unity within the organization and deliver comfort to entering freshmen and transfer students in the new university setting at UC San Diego. This independent student-run organization will hold many events for Korean students and will strive to merge the Korean international student society by creating connections that link numerous other Korean societies/organizations in other universities across the US in order to serve as an organization that provides wide networking opportunities and others derived from such invaluable opportunity. "}, {"name": "Korean Graduate Student Association (KGSA)", "description": "This is official Korean Graduate Student Association at UCSD. We provide social networks to current UCSD students and our Alumni. We have regular group meetings for various activities such as new students welcoming party, end-of quarter parties and  additional various events. Especially, we invite and share the information with Korean corporations for having recruit events at San Diego area (including on-campus events) to provide opportunities to qualified UCSD students."}, {"name": "KOTX", "description": "KOTX is a K-pop dance team that entertains and spreads Korean culture through K-pop. Creating a welcoming environment for all K-pop lovers and is open to all levels of dancers. LET'S GET KOTX!"}, {"name": "Kyrie Eleison", "description": "We, Kyrie Eleison at UCSD, are a student-run Catholic ministry that fosters spiritual growth for students seeking faith, identity and fellowship within the Catholic Church"}, {"name": "Lab, The", "description": "The purpose of The Lab is to unite the dance community at UCSD through fellowship. We seek to give the dance community the space and means to communicate and collaborate with other dancers, including those in the greater San Diego dance community. Anyone committed to fostering the camaraderie of our campus community through a mutual love of dance is welcome. Our goal is to create a safe space for dancers, regardless of team affiliation, to practice their craft and share it with others. Achievement of this goal will be supplemented by official community hosted events, including but not limited to: performance opportunities, competition opportunities, bonding and publicity events, etc. \r\n"}, {"name": "Lambda Chi Alpha", "description": "Lambda Chi Alpha is a greek social fraternity as accepted by IFC"}, {"name": "Lambda Phi Epsilon", "description": "The mission of the organization is to promote Lambda Phi Epsilon and its brothers by:\r\nDeveloping active members to become leaders through training and hands-on experience, to advance personal growth, and to achieve academic excellence.\r\n\r\nPerpetuating leadership of our alumni members in the community, creating opportunities, and encouraging the spirit of fellowship.\r\n\r\nPromoting positive Asian American awareness and providing the highest level of philanthropy in the community."}, {"name": "Lambda Theta Nu Sorority, Inc.", "description": "The purpose of Lambda Theta Nu Sorority, Inc. shall be to open doors of opportunity to the Latinas of our community. Our primary focus is academic excellence and meeting the needs of Latina women in higher education. Lambda Theta Nu Sorority, Inc. also promotes the advancement of Latinas through various campus activities and community services, and provides an environment for personal growth within a unit of sisterhood. Lambda Theta Nu Sorority Inc.'s priorities, however, will be placed upon academic excellence and community service."}, {"name": "Latter Day Saint Student Association", "description": "To serve our fellow students and increase understanding for who God and Jesus Christ are and what Their plan is for us, the children of God."}, {"name": "Launch Tank", "description": "Our purpose is to assemble a group of ambitious individuals, accompanied by their ideas, in order to open intellectual dialogues of the unexplored. Discussions will delve into a myriad of scientific topics. We aim to foster an environment where the ideas of passionate people can be shared. Through careful deliberation of students’ concepts, methods of improvement and experimentation will be exacted. All UCSD students are welcome to partake in the club’s educational discussions. "}, {"name": "League of Tritons", "description": "Our club seeks to provide both a recreational, social, and competitive community for players of the game League of Legends within UCSD and the greater San Diego area. By providing an environment of social interaction, friendly competition, and in-game support, we seek to give all of our members a positive gaming experience and the competitive drive to succeed in any gaming or non-gaming endeavor."}, {"name": "Lebanese Social Club", "description": "LSC is a club for those who are Lebanese and non-Lebanese interested in uniting and promoting the culture. We are a non-political, non-religious campus organization interested in expanding the appreciation of Lebanon and its culture through networking and social events."}, {"name": "Left Coast Post", "description": "The organization’s purpose shall be to publish ideals and articles related to the political interests of students, and aim to increase political activism on campus."}, {"name": "Lens Cap", "description": "Lens Cap is a film fluency and production club curated to include individuals interested and motivated about learning about film history, production, and experimentation within the medium. This club aims to give voice and purpose to media makers on campus, encouraging collaboration towards final cinematic projects. Members are given an opportunity to learn from the ground up as independent film makers and critics, using their ingenuity, arguments, and peers to establish skills in media. Meetings consist of open forum discussion, project assignments, and networking. "}, {"name": "Lighthouse College Life", "description": "To provide a church-sponsored Bible teaching Christian organization for students on-campus."}, {"name": "Linguistics Undergraduate Association (LINGUA)", "description": "Our purpose is to unify linguistics majors, minors and interested students through scholarly discussion, social activities and faculty interaction. We aim to foster a warm, inviting environment in which to explore academic and occupational opportunities within UCSD Linguistics department and beyond. "}, {"name": "LiNK (Liberty in North Korea)", "description": "LiNK's mission is to raise awareness about the North Korea human rights and refugee crises, and raise funds to help rescue North Korean refugees. "}, {"name": "Lion Dance at UCSD", "description": "1.\tLion Dance at UCSD is established for the purpose of providing cultural enrichment to UCSD and San Diego area by practicing, performing, and teaching the ancient art of Chinese Lion Dancing. 2.\tLion Dance at UCSD intends to perform for any UCSD affiliated groups and events as well as non-UCSD affiliated organizations interested in our presentation. 3.\tLion Dance at UCSD is a Not-For-Profit organization, and will rely on donations, contributions, and other forms of fundraising to finance equipment."}, {"name": "M.E.M.O. at UCSD", "description": "Fundraising in order to help the poor in Vietnam, Little Saigon (Westminster, CA), and San Diego.\r\n\r\nDuring our annual trip to Vietnam, we provide scholarships, school supplies, and toys to children.  We also help provide medical care, dental care, and surgeries to the poor.  In Little Saigon and San Diego, we run an annual health fair for those without insurance.  "}, {"name": "Magic: The Gathering Association", "description": "To gather together players and fans of the collectible card game \"Magic: the Gathering\", and to provide a community for them to play and develop their skills."}, {"name": "Malaysians in America at UCSD", "description": "The purpose of this cultural organization shall be to introduce Malaysian culture to all UCSD students as well as facilitate events for Malaysians students studying at UCSD;\r\n\r\nFacilitate events such as but not limited to:\r\na.\tAn organization aimed at encouraging conversation and bonding with new incoming Malaysian students and returning Malaysian students,\r\nb.\tProvide a sense of home for Malaysians studying abroad at UCSD,\r\nc.\tFor Malaysian students who seek it, assistance with assimilation in American culture,\r\nd.\tArrange events to introduce Malaysian culture and customs to other UCSD students (food, games, and traditional celebrations),\r\ne.\tCollaborate with other Malaysian Student Associations around the United States of America to form academic, social, and professional relationships;\r\n\r\nMalaysians in America (MIA) at UCSD is a non-profit student run cultural organization that will be financed through:\r\na.\tAssociated Students funding,\r\nb.\tExternal donations and charity,\r\nc.\tMIA fundraisers;\r\n"}, {"name": "Medical Foundations", "description": "We are a service based Student Organization devoted to providing our members with Medically related volunteer opportunities. Our members are paired with each other to create a care system in which specific questions or school assistance can be provided. We aim to connect our fellow students with their surrounding environments to bring companies and medically related schools to our campus. We wish to inform our students and hold work shops to help elevate their status and prepare them for a professional career. Through this we hope to achieve optimal success for our members and provide them with a dependable and personal network."}, {"name": "Medical Literature Society at UCSD", "description": "The Medical Literature Society at UCSD strives to promote the understanding of a career in medicine through a biomedical, psychological, and social perspective. We also encourage pre-medical and pre-health students to form a stronger community with each other and reach out to other students with similar career aspirations."}, {"name": "MedICamp", "description": "MedICamp is a UCSD student-run, not-for-profit organization dedicated to bringing students together under the common interest of advancing health in the community. We specifically focus on global outreach, encouraging students to think and act on a worldwide scale. \r\n"}, {"name": "MEDLIFE at UCSD", "description": "MEDLIFE is a secular, volunteer-run global health organization whose mission is to help families achieve greater freedom from the constraints of poverty, empowering them to live healthier lives. Our patients did not choose to be poor, but they do choose to strive for a better life. MEDLIFE stands beside them in this pursuit. We seek to achieve this goal through partnering with motivated individuals from poor communities working to improve their access to MEDs: Medicine, Education and community Development. MEDLIFE believes access to quality healthcare, education and personal development are basic human rights. To this end, we commit all our resources to bring Medicine, Education and Development to Low Income Families Everywhere. Along with affiliate chapters, MEDLIFE raises money for medicine, education and community development projects for low-income families around the world; actively learns about and increases awareness of inequality in global healthcare; and works to promote the highest standard of MEDLIFE's goals and reputation within the community."}, {"name": "MedTalks", "description": "The primary purpose of MedTalks is to provide pre-health professions students with information regarding stress and burnout prevention, as well as provide team building exercises in which pre-health students can have positive peer interactions. "}, {"name": "Mind-Body Nutrition: Students for Integrative and Preventive Medicine", "description": "Mind-Body Nutrition: Students for Integrative and Preventive Medicine (Mind Body Nutrition or MBN for short) is a non-profit student organization that aims to educate the general student populace about nutrition, health, and the food industry through professional and peer networks. MBN seeks to improve the food choices made by its members and our relationship with food, as well as create and foster a supportive network of like-minded, health-conscious individuals. MBN aims to promote health, nutrition, and wellness at UCSD and in the\r\ncommunity by engaging in healing as a holistic approach: mentally(mind), physically (body) and dietary (nutrition)."}, {"name": "Minority Association of Pre-Medical Students (MAPS)", "description": "The Minority Association of Pre-Medical Students, MAPS, is committed to supporting current and future underrepresented minority pre-health professions, addressing the needs of the underserved at UCSD and its surrounding communities and increasing the number of academic excellence, culturally competent, and socially conscious pre-healthcare professionals.\r\n"}, {"name": "Mock Trial @ UCSD", "description": "The purpose of Mock Trial at UCSD is to encourage interest in law advocacy and to prepare for Mock Trial competitions."}, {"name": "Model United Nations at UCSD", "description": "Model United Nations members simulate the United Nations by role-playing diplomats and forming delegations to attend conferences. At these conferences, students debate global issues, conduct speeches, draft resolutions, form political alliances, and resolve critical international problems. In doing so, Model United Nations students are exposed to international relations and its application in today's society, which expands their understanding of the world and becoming global citizens."}, {"name": "Morning Sign Out", "description": "Morning Sign Out (MSO) is an online publication that strives to turn science and medicine into something understandable for the greater public, providing them enough critical information that leaves them more knowledgeable than before."}, {"name": "Movement Exchange", "description": "Movement Exchange unites dance and service through its network of university chapters and international dance exchanges, and year-round dance programs."}, {"name": "Movimiento Estudiantil Chicanola de Aztlan (MECHA)", "description": "M.E.Ch.A. is a political voice for UCSD. It takes part in a series of political events through out the year, such as Raza Awareness Week. M.E.Ch.A. also honors many cultural holidays such as El dia de los Muertos and Las Posadas that occur in December; creating an atmosphere for social interaction. M.E.Ch.A. also strives in bridging the gap between High School and College by working directly with the youth of our community. This is accomplished through our annual Raza Youth Empowerment Conference, weekly outreach events, campus tours, overnight programs, and one on one mentoring. In realizing the importance of giving back to the community, we recognize that we are at UCSD to be successful students. We strive to build a community that is strong and united. The year is finalized with our Raza Graduation. Most importantly, throughout the year we build a strong network of people who are currently aware students, activists, and friends."}, {"name": "Muir Musical", "description": "The Muir Musical is a UCSD student organization that produces one completely student-run musical theatre production annually. Students from all six UCSD colleges are invited to participate in a full-scale Broadway production that marks the single musical theatre opportunity for UCSD students all year long. "}, {"name": "Muir Quarterly, (MQ) The", "description": "The Muir Quarterly publishes a satire/humor newspaper at UCSD and also provides social events for the student body."}, {"name": "Multi-Asian Student Association", "description": "As a Cultural/Social organization, we aim to promote and spread the idea that Asians are not just a single group of people, but are made up of many individuals from various and distinct cultural backgrounds. We hope to share these cultural values to the UCSD community by providing a fun and welcoming, stereotype-free, and all-inclusive social atmosphere for students."}, {"name": "Multi-Cultural Academic Leaders", "description": "Our purpose is to both enrich our minds through education, and broaden our points of views by learning about different cultures. This will tandem learning will push for academic achievement and provide a view on other people's cultures"}, {"name": "Multicultural Greek Council", "description": "Our purpose is the unification of the non-traditional Greeks. We are here to serve the UCSD community through our distinct cultures, academic agendas, community service projects, and most importantly to be an outlet for social interaction."}, {"name": "Musicians' Club @ UCSD", "description": "Our purpose is to give an outlet for music lovers to share and express their passion for music, to allow musicians to collaborate and learn from one another, and to give musicians of all levels the experience of performing with others in front of an audience."}, {"name": "Muslim Student Association", "description": "To provide an environment for the development and networking of Muslims on campus while fostering a sense of community between Muslims and non-Muslims through education.\r\n"}, {"name": "NanoEngineering & Technology Society", "description": "NET is a non-profit organization which facilitates communication and cooperation between NanoEngineering students, faculty members, and the industry abroad of NanoEngineering."}, {"name": "National Residence Hall Honorary", "description": "The purpose of the National Residence Hall Honorary is to serve and recognize individuals, groups, and programs on campus that contribute to the success of residential life at UC San Diego. "}, {"name": "National Society of Black Engineers", "description": "To increase the number of culturally responsible black engineers who excel academically, succeed professionally, and positively impact the community."}, {"name": "National Society of Collegiate Scholars, NSCS", "description": "As an honor society, we promote leadership, honor, integrity, as well as service on campus as well as in the community."}, {"name": "National Society of Leadership and Success", "description": "The National Society of Leadership and Success, Sigma Alpha Pi, is a leadership honor society. As an organization dedicated to building leaders who make a better world, the Society is a community where like-minded, success-oriented individuals come together to learn from and support one another. The Society was founded on the core belief that we accomplish more together than we would achieve alone. Members are provided with professional leadership training, helping them achieve their goals and gain a competitive edge in the employment market. \r\n"}, {"name": "Native American Student Alliance", "description": "The purpose of this organization is to facilitate the maintenance and education of Native American culture and beliefs, while maintaining a community for Native students (and Allies) on campus and contributing to local Native communities. Native American Student Alliance is a not-for-profit organization."}, {"name": "Navigators", "description": "To advance the Gospel of Jesus and His Kingdom into the nations through spiritual generations of laborers living and discipling among the lost."}, {"name": "New Life Student Ministry", "description": "To preach and teach God's word in a Biblical structure and encourage Christians at UCSD."}, {"name": "Nikkei Student Union", "description": "To allow Japanese American, Japanese and any other interested student to interact in a socially conductive environment. To promote awareness of Japanese American and Japanese culture, history and issues on the UCSD campus. To provide a link between the Japanese American community on the UCSD campus and the Japanese American community in the areas surrounding UCSD. "}, {"name": "No Lost Generation at UCSD", "description": "No Lost Generation (NLG) is an organization supported by the U.S. Department of State that focuses on advocating child protection and education for the youth affected by the global refugee crisis. NLG aims to promote awareness through networking opportunities with NGOs, IGOs, and aid groups, fundraising, and volunteering directly with local and virtually contacted refugees. NLG-UCSD hopes to encourage student humanitarian efforts within the San Diego community and abroad through collaboration with university students across the U.S., government agencies, and international organizations.\r\n"}, {"name": "Noblemen", "description": "Noblemen exists to provide Christian men with a supportive community which stimulates them to enhance their communities by leading lives of integrity, compassion, and purpose. "}, {"name": "Nomads Theatre Company: A Voice For New Playwrights Who Want To Be Heard", "description": "This company’s motivation is to give a voice to local playwrights, especially those at UCSD. Our company is dedicated to helping playwrights from beginning to end: we offer constructive criticism, staged readings, and assistance to works in progress. We provide an open forum for new and experienced artists to develop their craft. "}, {"name": "Nu Alpha Kappa, Inc.", "description": "We, NU ALPHA KAPPA, seek to unite and involve all students in a more harmonious and brotherly atmosphere through academic, social, and cultural means. There is a need to interface the various backgrounds that constitute the student body of our fraternal university chapter, in order to improve relations amongst all students and the community."}, {"name": "Okinawa Karate Do at UCSD", "description": "The Okinawa Karate-do at UCSD seeks to promote and preserve traditional Okinawa Karate."}, {"name": "Origami Folders at UCSD", "description": "To provide a venue for origami enthusiasts to fold and share their passion with others and to introduce beginners to the traditional Japanese art and its applications in math and engineering.\r\n"}, {"name": "Origins", "description": "To establish a dangerously authentic community of Christ-followers who encounter and demonstrate the power and love of God"}, {"name": "Page One", "description": "This organization enlighten students who are trying to get information about seeking job, but those people who don't know what to do about it. We are especially targeting at Japanese company either in Japan or in the United States. We basically try to understand any subject relating to Job hunting including  Entree Sheet, Interview, and so on. We will have some instructors and be held some events to get better understanding about this subject."}, {"name": "Pakistani Student Association", "description": "The purpose of this cultural Association is to inform all interested persons of the customs and traditions of Pakistani culture, to further the knowledge of interested persons of the history of Pakistan, and to serve all UCSD and other University Students, Faculty and Staff, including International Students, in achieving the above stated goals. "}, {"name": "Pan-Arab Student Association", "description": "The purpose of this Organization shall be to:\r\n\r\nServe students of Arab descent and those interested in Arab culture, regardless of heritage, at UCSD by providing a forum for identity exploration, community building, and cultural expression. \r\n\r\nOffer a space for support and empowerment culturally, socially, politically, and academically.\r\n\r\nPromote and preserve the positive image of Arabs.\r\n\r\nCreate a platform for Arab representation and advocacy at UCSD.\r\n\r\nProvide a means to educate the UCSD community about Arab culture and the struggles and experiences of Arab-Americans.\r\n\r\nCollaborate with other groups deemed as underrepresented and underserved by the Student Affirmative Action Committee (SAAC)."}, {"name": "Panhellenic Association", "description": "To oversee the 11 Panhellenic and 1 Affiliate Chapters within the Panhellenic Council. These chapters are: Alpha Chi Omega, Alpha Epsilon Phi, Alpha Omicron Pi, Alpha Phi, Chi Omega, Delta Delta Delta, Delta Gamma, Kappa Alpha Theta, Kappa Kappa Gamma, Phi Sigma Rho (Affiliate), Pi Beta Phi, and Sigma Kappa."}, {"name": "PARSA", "description": "The Persian Association for Rendering Science and Art (PARSA) at UCSD is a non-profit organization and independent of any political or religious beliefs.  Activities of PARSA includes following purposes:\r\n \r\n  I. Increase the general public awareness regarding Persian Art and Science\r\n II. Promote the Iranian/Iranian-American young and senior scientists and artists\r\nIII. Bring Iranian/Iranian-American Scientist and Artist on-campus towards fostering young talents and show casing for general awareness. "}, {"name": "Patent Law Club at UCSD", "description": "PLC has the following goals:\r\n1) To educate graduate students and postdocs about careers in patent law and to prepare them for Patent Agent/Analyst positions by organizing information sessions with local law firms \r\n2) To set up and maintain a platform for graduate students and postdocs to form study groups to pass the USPTO Patent Bar Exam \r\n3) To create an alumni network of individuals in the field of patent law\r\n\r\n"}, {"name": "Pepitos", "description": "The purpose of this organization shall be to provide a not for profit social atmosphere for UCSD students interested in promoting and exhibiting school spirit. "}, {"name": "Phi Alpha Delta", "description": "Pre-Professional Fraternity (pre-law).\r\n\r\nThe purpose of this Fraternity shall be to form a strong bond uniting students and teachers of the law with members of the Bench and Bar in a fraternal fellowship designed to advance the ideals of liberty and equal justice under law; to stimulate excellence in scholarship; to inspire the virtues of compassion and courage; to foster integrity and professional competence; and to promote the welfare of its members."}, {"name": "Phi Beta Lambda at UC San Diego", "description": "Mission Statement: To bring business and education together in a positive working relationship through innovative leadership and career development programs."}, {"name": "Phi Delta Epsilon", "description": "To prepare our members for a career in health and to promote fraternity amongst our members"}, {"name": "Phi Delta Theta", "description": "Helping every individual to meet his true potential is the bedrock of the Phi Delta Theta Fraternity. By celebrating each person’s true self, and by learning from each other’s strengths while helping to improve each other’s weaknesses, every member of Phi Delta Theta develops into a greater version of himself than he could ever on his own. Rather than try to find young men to “mold” into some ideal, we celebrate the uniqueness of each individual and, through encouragement, values, example and brotherhood, empower every brother to exceed his personal expectations."}, {"name": "Phi Gamma Delta", "description": "We, the founding fathers of the Chi Lambda Chapter of UCSD will endeavor to provide an opportunity for friendship, scholarship and service to our members now and in the future.  We seek excellence.  We believe that the Phi Gamma Delta Chapter we bring back to UCSD must take into account the unique circumstances of our university and our student body.  In order to be successful we must adapt our program to be in harmony with other campus constituencies, such as our student athletes and student leaders."}, {"name": "Phi Iota Alpha Fraternity, Inc.", "description": "Phi Iota Alpha Fraternity, Inc. is the Oldest Latino Fraternity in Existence. The history of Phi Iota Alpha Latino Fraternity is the history of all Latino college students and professionals who strive to keep their intellectual heritage alive.\r\n\r\nPhi Iota Alpha’s vision is La Unión De La Patria Latino Americana and our mission is the promotion of personal, community, and Pan-American development through the ideals of Pan-American intellectuals and their philosophies. We believe in a commitment to the Latin American culture which involves intellectual development, cultural consciousness, personal growth, personal achievement, and social awareness.\r\n"}, {"name": "Phi Lambda Rho Sorority, Inc.", "description": "Our purpose is to promote academics, community service, sisterhood, and the Chicano/Latino culture."}, {"name": "Phi Sigma Pi", "description": "Phi Sigma Pi National Honor Fraternity is a co-educational honor fraternity with the purpose of fostering the ideals of scholarship, leadership and fellowship."}, {"name": "Phi Sigma Rho", "description": "Phi Sigma Rho is a social sorority for women in engineering and engineering technology. Through Phi Sigma Rho, our sisters develop the highest standard of personal integrity, strive for academic excellence, and build friendships that will last a lifetime."}, {"name": "Photo Club", "description": "To build a community of students interested in photography. We want to shoot photos, learn the art,and grow as photographers."}, {"name": "Pi Alpha Phi", "description": "Asian American Interest Fraternity"}, {"name": "Pi Beta Phi", "description": "The mission of Pi Beta Phi is to promote friendship, develop women of intellect and integrity, cultivate leadership potential and enrich lives through community service.   \r\n"}, {"name": "Pi Kappa Alpha", "description": "To set the standard of integrity, intellect, and achievement\r\nfor our members, host institutions, and the communities in which we live."}, {"name": "Pilipino Undergraduate Society for Health", "description": "As members of the Pilipin@ Undergraduate Society for Health (PUSH), we believe in the academic empowerment of Pilipin@ American students. We are leaders of the Pilipin@ community who strive to be an active presence through service, who establish networking opportunities and collaborations, and who promote education and awareness of health issues in order to productively direct ourselves towards future goals in health professions."}, {"name": "Pokemon League at UCSD", "description": "The purpose of Pokemon League at UCSD is:\r\n*To bring members of the Pokemon community together and create a social setting for anyone interested in anything related to Pokemon.\r\n*To provide a safe space for people within the Pokemon community, regardless of race, background, sexual orientation, gender, and religious association. \r\n"}, {"name": "Pre Law Society", "description": "UCSD’s Pre-Law Society is a non-profit organization. It’s purpose is to give its members a wide variety of information as well as offer resources for students interested in attending law school. The officers of this organization are chosen both through an election and appointment process by current officers; they are chosen based on their leadership abilities and desire to further the organization. The organization also hold’s a minimum of one formalized meeting a quarter, with the potential for "}, {"name": "Pre-Dental Society/Free Dental Clinic at UCSD", "description": "To provide additional educational resources to Pre-Dental students through our general body meetings, special speaker series, and student run free clinics."}, {"name": "Pre-Health Professionals Club", "description": "The purpose of this organization is to unify pre-health students as well as to serve as a resource across campus. Furthermore, this organization will provide exposure and opportunities to the wide range of professions in the health field."}, {"name": "Pre-Medical APAMSA at UCSD", "description": "The purpose of our organization is to involve and educate pre-medical undergraduate students at UCSD on the health issues that pertain to the Asian community and enable them to serve the Asian Pacific communities throughout the greater San Diego region.  As a pre-medical organization, we plan to educate  our members on health issues that pertain to the Asian community, provide them with resources and insights into medical school, the medical school application process through a mentorship program. \r\n"}, {"name": "Pre-Meds Without Borders", "description": "Nonprofit organization dedicated to advancing healthy initiatives through proactive engagement and high impact volunteer work.\r\n\r\nBy establishing partnerships and coordinating with local non profits, we continue to provide a platform for emerging leaders to make meaningful contributions within their respective communities."}, {"name": "Pre-Pharmacy Society (PPS)", "description": "Pre-Pharmacy Society is an organization that promotes the career of pharmacy through a variety of resources that include workshops, volunteer opportunities, guest speakers, and networking to compliment the interests of our members. Our main objectives are to better prepare our members for pharmacy school admission and to learn and explore the multitude of career options for pharmacists. While providing essential information to our members, PPS also strives to make the club as fun as possible for our members."}, {"name": "Pre-Physician Assistant Student Organization", "description": "The Pre-Physician Assistant Student Organization is a non-profit student organization whose mission is to collaborate with UC San Diego faculty, alumni, and other university and community resources to provide our members with the means to reach their goals of becoming physician assistants. We strive to educate our members about the physician assistant profession and provide them with information about physician assistant program admission requirements, application procedures, and other healthcare opportunities."}, {"name": "Pre-SOMA", "description": "The purpose of Pre-SOMA is to increase osteopathic medicine awareness at UCSD, dispel any misconceptions or prejudices about osteopathic medicine, serve as a \"clearing-house\" of information about osteopathic medicine, and serve as a support group for those applying to osteopathic medical schools. Pre-SOMA is also dedicated on finding D.O.'s for students interested in volunteering/shadowing a D.O. in San Diego."}, {"name": "Pre-Veterinary Student Association at UCSD (PVSA)", "description": "This non-profit organization is dedicated to introducing the idea of veterinary medicine to interested students, providing peer networking and support for pre-veterinary students, and offering opportunities to gain experience in the veterinary field. This organizations helps to guide pre-veterinary students and help them make informed decisions about their goals in the field of veterinary medicine as they embark on this journey of helping diverse species. "}, {"name": "Producers & Remixers Organization", "description": "Establish a community of music producers to network, collaborate, and throw events on campus."}, {"name": "Project BELL", "description": "Project BELL is a dynamic initiative that strives to develop lifelong learners and active citizens who make a lasting impact in their neighborhoods, communities, and world at large by using education as a creative platform. "}, {"name": "Project Happiness", "description": "Project Happiness empowers a dynamic and dedicated corps of UCSD student volunteers to bring programming­, recreational (arts), educational (tutoring and mentoring) and social service (health & dental counseling)­ to families of children affected with medical challenges in the San Diego area. Volunteers will selflessly donate their time to create program materials and deliver programs. Our volunteers will help relieve the anxiety of these afflicted families through a context of fun and play and help foster a spirit of courage to confront challenges that lie ahead. Project Happiness volunteers will spread happiness by restoring a sense of normalcy to the pediatric healthcare environment."}, {"name": "Project Nicaragua", "description": "A non-profit organization that aims to improve the quality of health care in Nicaragua, cultivate humanitarian traits in future professionals, and raise awareness of Nicaragua."}, {"name": "Project RISHI", "description": "Project RISHI (Rural India Social and Health Improvement) is an organization that strives to improve the conditions of villagers in some of the most remote places in India. We aim to help these underprivileged people by raising money during the academic year and using that money to complete various projects in these areas. Projects will include medical initiatives, educational efforts, agricultural support and correction of social problems."}, {"name": "Prospect - The Journal of International Affairs at UCSD", "description": "PROSPECT is an undergraduate journal of international/transnational affairs at the University of California, San Diego. \r\nServing as a forum for intelligent discourse relating to international and transnational affairs, the journal showcases works \r\ncreated by undergraduates who wish to broaden their understanding of issues of contemporary and global \r\nrelevance.   \r\n\r\n"}, {"name": "Psi Chi", "description": "Psi Chi, the International Honor Society in Psychology, seeks to encourage and stimulate excellence in the field of psychology. We do this by providing resources, information, and activities that allow students to reach their academic, career, and personal goals. Some of these events include: guest speakers with real-life experience in psychology, graduate school panels, socials, and community service projects. Our goal is to foster a diverse community centered on mutual enthusiasm and interest in psychology."}, {"name": "Psi Chi Omega", "description": "We are an Asian-interest social fraternity established to uphold the values of integrity, perseverance, and eternal brotherhood."}, {"name": "Public Health Brigades", "description": "Public Health Brigades is a non-profit, student organization whose mission is to improve the infrastructure of the homes in the community, primarily in order to help prevent diseases/respiratory problems and to increase the overall health of the families in the community. The current country of emphasis is Honduras where the organization provides public health education and infrastructure in collaboration with Sociedad Amigos de los Niños, a private non-profit organization founded by Sister Maria Rosa Leggol. The PHB chapter at UCSD will participate in one brigade per academic year. The brigade will be 7~8 days long and take place during a school break. In addition, volunteers will work together to help prepare a health education presentation on a given health topic (ie. dental hygiene, etc.) for students in the local community. "}, {"name": "Public Health Club at UCSD", "description": "The overarching goal of the Public Health Club is to bring students, staff and faculty with an interest in public health, healthy lifestyles, or community health together.  The Public Health Club will serve as an umbrella organization wherein members will be able to explore different areas of interest within the public health field. The Public Health Club will also help members by providing opportunities for volunteerism, health promotion, and internships. "}, {"name": "Quidditch", "description": "To share in our passion for Quidditch and Harry Potter as a community, by having fun. "}, {"name": "Quiz Bowl Club at UCSD", "description": "To promote and participate in quiz bowl competitions throughout the United States."}, {"name": "Red Cross at UCSD", "description": "To provide Red Cross related activities and service opportunities to the UCSD student body."}, {"name": "Redeemer San Diego", "description": "Redeemer San Diego is a Christian organization that seeks to encourage the spiritual growth of UCSD students through the study of the Bible, structured, free-flowing discussion and relationship-building activities. This club is open to all and non-profit. "}, {"name": "Redeemer's Grace Church", "description": "We are part of a local church called Redeemer's Grace Church of San Diego. We seek to proclaim the gospel of Jesus Christ and one of our ministries is to the college campus of UCSD."}, {"name": "Refugee Connection", "description": "Refugee Connection's mission is to work with multiple refugee organizations in order to expand our volunteer services and benefit the San Diego refugee community as much as we can. We aim to provide a domestic option for Global Health majors and minors to complete their field experience through volunteering with the health needs of refugee populations. We also hope to partner with UCSD professors to incorporate refugee issues into the education of students. As our rebranded Refugee Connection organization at UCSD, we plan to host events to fundraise for different local refugee organizations, including the continuation of the Culture Cup soccer tournament."}, {"name": "Rock College at UCSD", "description": "Our purpose is to ensure that every UCSD student has the opportunity to know Jesus, grow in community, and thrive in ministry.\r\n\r\nWe are committed to leading university students into a genuine community and a deep, abiding relationship with Jesus Christ that will inspire each person to offer hope to a hurting world."}, {"name": "Rotaract Club at UCSD", "description": "The purpose of Rotaract is to follow Rotary International's motto of \"Service Above Self.\" We are devoted to organizing and participating in both local and international service events. In addition, we strive to prepare our members for the future by offering professional development, leadership, and networking opportunities."}, {"name": "Rubik's Cube Club", "description": "To bring cubers and non-cubers together to learn more about solving the Rubik's cube, cuboids, or any other puzzles."}, {"name": "SACNAS Chapter at UC San Diego", "description": "The purposes of this organization shall be: (1) To further the work of, to improve the effectiveness of, and to enhance the public understanding of and appreciation for Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in science; (2) To cooperate with other individuals, organizations, clubs, and other groups whose purposes include the achievement of public understanding for Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in the sciences; (3) To promote student recruitment and retention of Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in science at UC San Diego; (4) To provide a forum for students from different science majors and science related majors to come together for academic, community service and social activities at UC San Diego.\r\n"}, {"name": "Salsa Club at the University of California San Diego", "description": "The Salsa Club at UC San Diego is a non-profit organization offering Salsa dance instruction to the student population at large (undergraduate, graduate, part-time, full-time), faculty, staff, and alumni. We hope to create a fun social group that will foster a life-long appreciation for dancing in general. We also seek to enrich the UCSD campus life by providing an affordable and entertaining outlet for students to learn about Salsa dancing"}, {"name": "Salsa Society", "description": "To provide a fun and safe learning environment in learning how to dance Salsa and Bachata through regular weekly meetings and quarterly socials. Lessons will not be based on random combinations but rather on a curriculum that can easily allow any new or experienced dancer to become proficient and comfortable on the social dance floor."}, {"name": "Saltman Quarterly", "description": "The purpose of \"Saltman Quarterly\" (SQ) is to provide a medium for undergraduate students at UCSD to publish biological research as well as communicate new advances in the field of biology, encompassing topics ranging from medicine to ecology. SQ also provides authors and staff members with the skills needed to communicate science effectively to both biology and non-biology majors."}, {"name": "San Diego Developers", "description": "To promote the growth of software development and encourage students to undertake long term development projects with partners in order to reinforce the concept of programming as a team"}, {"name": "San Diego Health Connect", "description": "San Diego Health Connect is a nonprofit\r\nstudent organization comprised of UC San\r\nDiego students. We volunteer at food banks and medical clinics and address the social\r\ndeterminants of healthcare\r\noutcomes by providing helpful information to the San Diego\r\ncommunity. We supply information about health and wellness resources available to them, and\r\nthese resources are provided by private charities and health professionals not associated with our\r\norganization. Disclaimer: We do not dispense medical resources, equipment, medication, or\r\nmedical advice. All of the information we provide is verified through the organization San Diego\r\n211\r\nthrough a process that we have personally evaluated alongside\r\ntheir community outreach\r\ncoordinator."}, {"name": "San Diego Homeless Health Initiative", "description": "The purpose of this organization is to create general health presentations and tutorials to present to homeless individuals or groups in the San Diego County area in an attempt to arm the homeless population with knowledge to improve their health outcomes. We plan on doing this by doing field research to identify the biggest causes of homeless mortality and morbidity and we will try to understand the issues from the context of a homeless person, and try to design appropriate interventions that require minimal resources, in order to maximize the sustainability to the homeless population. We will then create easy-to-follow presentations to give to the target population, supplemented by necessary items to maintain sanitation and health. These items will be purchased using funds from fundraisers that we will arrange.  "}, {"name": "San Diego Indonesian Association", "description": "To promote Indonesian culture to University of California, San Diego community through social and other non­profit events. To create camaraderie between the members. To build a network with other Indonesian clubs.\r\n"}, {"name": "San Diego Microbiology Group", "description": "The San Diego Microbiology Group (SDMG) was organized in 1996 to address the need for greater scientific and collegial interaction among microbiologists in the greater San Diego and Southern California areas. Since its inception, the primary goal of the SDMG has been to increase communication in the microbiology community by sponsoring monthly evening seminars and an annual all-day symposium in the spring. SDMG affords the opportunity for microbiologists of all ages, interests, and affiliations to gather and, before and after the talks, enjoy the opportunity to meet others of like interests."}, {"name": "SangamSD", "description": "UC San Diego's largest South Asian organization, SangamSD aspires to promote South Asian cultural awareness and education within the UCSD community and beyond. SangamSD's goals of uniting South Asians at UCSD as well as spreading diversity, tolerance, and the understanding of all South Asian cultures is reflected through its numerous social, cultural, and educational events. "}, {"name": "Scholars Society at UCSD", "description": "To promote academic development among recipients of any UCSD Scholarships, to facilitate communication among UCSD scholars and alumni, and to provide service for the surrounding community."}, {"name": "Scientista Foundation Chapter at UCSD", "description": "The mission of this organization is to empower undergraduate and graduate women in science, technology, engineering, mathematics, and medicine (STEMM) by providing a strong inter and intra campus community,online resources, and visible role models. In order to achieve these goals, Scientista will provide educational programs and create online content on our blog, including student spotlights, networking opportunities with successful women in STEMM, and socials and study groups.  This organization is a chapter of the National Scientista Foundation."}, {"name": "SEARCH", "description": "UCSD is known for its strong emphasis in the sciences, and many students aim to pursue careers in the health sector. But there is more to health than getting an MD, PharmD, or DDS. There are dozens of other careers, and SEARCH is here to let you know about these other paths as well as the standard MD, PharmD, and DDS routes. We host a series of informational seminars, in which speakers from different careers in the healthcare world come to educate students on what they do, and how you can pursue similar careers in the future. For students pursuing MD, PharmD, and DDS degrees, we host informative sessions about current internship opportunities and certifications they can hold while still in college. For all undergrads interested in healthcare, come and learn about the different degrees you can get, which schools offer them, what your expected salaries could be, and how a career in health may interest you."}, {"name": "Seashore Campus Fellowship", "description": "(1) Preach the true and complete gospel of the True Jesus Church, as revealed by the Holy Spirit (2) Provide spiritual cultivation and edification to members and friends on campus through Bible study, prayer, and mutual encouragement according to the teaching of our Lord Jesus Christ"}, {"name": "SENDforC San Diego", "description": "SENDforC San Diego is the San Diego branch of the non-profit organization Support, ENcourage, and Develop for Children, Inc. (referred to as SENDforC). SENDforC San Diego advocates STEM education and mentoring of high school students. Members of this club will serve as University Mentors and assist students to engineer solutions to everyday problems through playful and hands-on projects. SENDforC San Diego will implement the QDII curriculum developed by SENDforC Inc. to produce technological, social entrepreneurs."}, {"name": "Serotones", "description": "The purpose of this association shall be a non-profit organization for pharmacy students at the UCSD Skaggs School of Pharmacy and Pharmaceutical Sciences with an interest in music dedicated to providing relief to patients in hospitals and other health settings through music. "}, {"name": "Sex Geekdom SD", "description": "Sex Geekdom is a worldwide network of smart, sexy individuals with a passion for discussing, thinking about and learning about sex, sexuality, gender, kink, monogamy and long-term relationships, non-mono and poly relationships, sexual health, sexual philosophy, relationship and power dynamics, sexual ethics and morals and anything else in related spheres. \r\n\r\nSex Geekdom is based around regular meet ups - these can take various forms such as: moderated and focused discussion groups, casual coffee meet ups and happy hours, trivia nights, workshops, group outings, supporting social outreach groups, etc. "}, {"name": "She's the First", "description": "She's the First is a non-profit undergraduate student organization that works to give scholarships to young women in low-income countries in order to attend secondary school.  She's the First helps raise awareness about the socio-economic conditions of the women of low-income countries to help create first generation graduates.  "}, {"name": "Sigma Alpha Epsilon", "description": "We believe in connecting free thinking, innovative gentlemen through brotherhood and social experiences.\r\n\r\nWe believe in the original brotherhood experience our founders created.\r\n\r\nWe believe in the True Gentlemen.\r\n\r\nThe Mission of SAE is to promote the highest standards of friendship, scholarship, and service for our members based upon the ideals set forth by our founders and as specifically enunciated in 'The True Gentleman'."}, {"name": "Sigma Alpha Mu Fraternity", "description": "To unite each undergraduate member toward a more meaningful life, to prepare members for responsible fraternity and community involvement."}, {"name": "Sigma Alpha Zeta", "description": "The purpose of Sigma Alpha Zeta Sorority, Incorporated shall be to act as an elite multicultural group who promotes the upward mobility of women and enhances the community by means of education and voluntary services."}, {"name": "Sigma Chi Fraternity", "description": "The purpose of this fraternity is for a group of men to become better leaders and gentlemen through our core values of friendship, justice, and learning."}, {"name": "Sigma Kappa Sorority", "description": "The purpose of Sigma Kappa Sorority is to unite its members in a bond of sincere friendship for the development of character and the promotion of social, philanthropic, and intellectual culture."}, {"name": "Sigma Nu", "description": "To promote scholastics, a good social environment, philanthropy, sports, and leadership for UCSD students."}, {"name": "Sigma Omicron Pi", "description": "To promote Asian American Awareness through unity, friendship, leadership and service."}, {"name": "Sigma Phi Epsilon", "description": "Leadership, Greek life, community development, brotherhood."}, {"name": "Sigma Pi Alpha National Sorority, Inc.", "description": "Sigma Pi Alpha is a Chicana/Latina based sorority that focuses on community service, campus involvement, and sisterhood and within these components we stress academics and cultural awareness. \r\n\r\nWe hope to provide women with the means to access higher education and to provide women on campus with community service opportunities and academic, personal, and individual support.\r\n\r\nAlthough we are a Chicana/Latina based sorority, our sisterhood reaches out to all different ethnicities. "}, {"name": "Sikh Student Association", "description": "To promote awareness of Sikhism and inform others of its principles while building a close knit community."}, {"name": "Singapore Students Association", "description": "SSA@UCSD is a Singaporean cultural organisation meant to bring Singaporean students and students based in Singapore together.\r\n\r\nThe purpose of the organization is to Promote and increase awareness about Singapore and Singaporean culture amongst the UC San Diego students, faculty and staff; Foster, unite and support the Singaporean community at all levels in and around UC San Diego; Provide opportunities for members to interact and network within the community; and Serve as a link for members to external Singapore government agencies, events and other resources, especially to promote career development in Singapore."}, {"name": "Sitaare", "description": "Sitaare is UCSD’s premiere coed South Asian a cappella group. \r\nSince 2006 we have engaged in light-hearted vocal mischief, performing and competing at numerous events such as UC Berkeley's Anahat A Capella competition, UT Dallas' Awaazein competition, and various community events in the San Diego area including UCSD Sangam’s annual South Asian culture show. Our repertoire consists mainly of South Asian pop and film music, along with the occasional English R&B or pop piece."}, {"name": "Slippery When Wet", "description": "Slippery When Wet's purpose is to teach its members long form improvisational skills and utilize them during frequent free performances for UCSD's student body as well as the surrounding San Diego Community."}, {"name": "Society at UCSD", "description": "The purpose of Society at UCSD  is to create a safe place to study everything or ask any questions anyone might have about Jesus. We want to be a blessing on the campus of UCSD, and teach students how to practically build a Church.\r\n\r\n"}, {"name": "Society for Undergraduate Research and Outreach (formerly IMSD Society)", "description": "The Society for Undergraduate Research and Outreach will focus on enhancing the skills that are important for undergraduates to master in order to be successful in the world of scientific research; by providing an environment for students to share and discuss research with their peers, the society will mimic the way researchers interact with each other in the scientific community.  At the same time, members will give back to the community by also acting as a mentorship program for high schools in the surrounding communities."}, {"name": "Society for Women in Graduate Studies in Chemistry and Biochemistry", "description": "The purpose of our group is to build a network amongst the graduate students within the Chemistry and Biochemistry Department to foster professional development and to address issues that affect women in the fields of chemistry and biochemistry. We aim to generate constructive discussion on various topics such as career planning and professional negotiation tactics, as well as personal issues such as staying motivated and addressing grievances. We also aim to positively impact graduate student well-being by providing encouragement and emotional support and by advising fellow students on practical matters related to their current work. "}, {"name": "Society of Asian Scientists & Engineers at UCSD", "description": "The Chapter is committed to preparing members for success in the global business world, celebrating diversity, and contributing back to the community.\r\n\r\nThe objectives and goals of the Chapter shall be to:\r\n1. Support and develop programs that provide for the advancement of Asian heritage scientists and engineers. This goal shall be implemented by:\r\n    -Career Workshops\r\n    -Seminars and Symposia that focus on bettering the employability of members by bolstering the soft skills of members, working on their resumes, and teaching interview skills.\r\n2. Develop and support programs that aid Asian heritage scientists and engineers who are actively seeking careers.\r\n    -Interactions with potential employers\r\n    -Tutoring/Curriculum assistance\r\n    -Mentoring programs\r\n3. Provide a forum for professional development and for the connection with entrepreneurial opportunities.\r\n4. Inform the public of contributions and advancement made by Asian heritage scientists and engineers in newsletters and awards ceremonies."}, {"name": "Society of Automotive Engineers", "description": "To equip up and coming engineers and entrepreneurs with fundamental skills in: design, design for manufacture, data acquisition, cost reduction, cost-benefit analysis, project management, technical writing, marketing, and communication through the lens of building a formula style race car.\r\n\r\nThe FSAE competition itself involves the design and development of a proposed prototype formula style race car that is then taken to one or more of the nine international events hosted by SAE International to be raced against universities from around the world. The multi-faceted competition is composed of static and dynamic events and truly challenges students to meet the grueling demands of the project overall.\r\n\r\nThe fizz is strong with members."}, {"name": "Society of Civil and Structural Engineers", "description": "This Society is established for the following purpose: To supplement the engineering education of University of California, San Diego students, to promote the personal and professional development of its members, and to improve the community of which we are part through outreach and community service."}, {"name": "Society of Hispanic Professional Engineers", "description": "Mission\r\n\r\nSHPE changes lives by empowering the Hispanic community to realize their fullest potential and impacts the world through STEM awareness, access, support and development.\r\n\r\nVision\r\n\r\nSHPE's vision is a world where Hispanics are highly valued and influential as the leading innovators, scientists, mathematicians and engineers."}, {"name": "Society of Physics Students at UCSD", "description": "SPS strives to create a space for Physics students to connect and find a community where they can make friends and get support as they go through their time here at UCSD. We hope to be a link and resource for students to our Physics department and our faculty, by providing our members information about upcoming events hosted by our Physics department as well as hosting our own events that would help students meet and talk to professors. These events would include, but aren't limited to, research presentations, socials, and lab tours.\r\n\r\nAdditionally, we would serve as a link for students to register with the National Society for Physics Students, and typically host the annual Physics Graduation."}, {"name": "Society of Undergraduate Mathematics Students (SUMS)", "description": "To unite math students under a social umbrella, to strengthen the relationship between students and professors, to provide information about careers, internships, and other opportunities in mathematics, and to explore mathematics in a fun, non-profit environment."}, {"name": "Society of Women Engineers (SWE)", "description": "Motivate women to achieve full potential in careers as engineers and leaders, expand the image of the engineering profession as a positive force in improving the quality of life, and demonstrate the value of diversity."}, {"name": "Sociology Club", "description": "•\tTo provide an organization for students who are interested in sociology. To create a fun and supportive environment for incoming and existing students. To educate students about upcoming deadlines, events, and helping them network with other likeminded students. To provide an opportunity to network with the staff and faculty in the Sociology department. To provide learning experiences that are educationally illuminating and to prepare students for a future in sociology. To inform sociology students of service, career and summer opportunities in the field of sociology.\r\n\r\n\r\n\r\n"}, {"name": "Special Olympics @ UCSD", "description": "Special Olympics at UCSD aims to provide volunteers and support in the fields of coaching, logistics and event coordination for the Special Olympics San Diego Region. Students can become coaches for soccer, field hockey, bowling, softball and a variety of other sports. They can participate in helping out in the clinics that provide health screenings for all of the athletes. Students can also assist with event coordination by doing set up, being ushers and also taking video and photos for the club and national page. We're also very fun! As we plan on doing a lot of socials with the Special Athletes including team dinners, ice cream runs and monthly team outings to theme parks and other places of interest in San Diego. "}, {"name": "Speech, Physical, and Occupational Therapy (SPOT) (formerly P-PT/OT Society)", "description": "To provide a gateway into the physical, occupational, and speech therapy fields through providing information about SPOT programs, preparing students for the application process, hosting speakers from the field and social networking."}, {"name": "Strides Running Club", "description": "to provide a fun and social atmosphere for recreational and competitive running."}, {"name": "StRIVE", "description": "Our program focuses on breaking down the wall that separates those with disabilities from their non-disabled peers. It is unique in its unification of the peer-mentorship of young adults with mental and physical disabilities and their transitional community education. We mainly work with students ages 18-22 with disabilities, and we partner with the Transitional Resources for Adult Community Education (TRACE) department of the San Diego Unified School District. Our student volunteers serve as teachers that target three critical areas imperative to independent living: communication, health awareness, and vocational skills. They also serve as mentors who participate in recreational activities and field trips that supplement the student’s community education. Our program is open to all UCSD undergraduates who are interested in empowering and bonding with other students their age with a wide range of disabilities."}, {"name": "Student Foundation", "description": "To promote, facilitate and perpetuate the philanthropic spirit among the UCSD student community."}, {"name": "Student Health Advocates", "description": "Student Health Advocates (SHAs) is an organization of trained student volunteers who educate other students about health issues and concerns and promote health and wellness in all areas of campus life.  These are two specialties within the Student Health Advocates program, General Health and Sexual Health."}, {"name": "Student Involvement Leadership Consultant (SILC)", "description": "Student Involvement Leadership Consultants, or SILCs, are bright, motivated UCSD students committed to sharing our leadership and involvement experience to serve the UCSD community on whole. Our mission is to provide the University of California, San Diego student organizations with direct services to assist in their operations and to provide the campus-wide student population with consultation regarding student involvement and leadership opportunities."}, {"name": "Student Shapers", "description": "The purpose of our organization is to foster an inclusive learning environment for those who enjoy surfing and shaping. We strive to learn and practice the art of hand shaping surfboards, and program events for members to enjoy surfing and shaping. "}, {"name": "Student Support Services Club (SSSC or SSS Club)", "description": "To encourage and foster social, recreational, and cultural growth and experiences in the spirit of diversity."}, {"name": "Student Veterans Organization", "description": "The Student Veteran Organization (SVO) at University of California, San Diego purpose is to coordinate campus activities, provide pre-professional networking, and generally provide a touchstone for student veterans in higher education. The SVO works to facilitate and organize events that benefit student veterans, the general student population, and members of our community, as well as connect veterans with resources both on and off of our campus."}, {"name": "Students Against Mass Incarceration", "description": "This student organization seeks to educate the campus about mass incarceration (the Prison Industrial Complex) as a form of institutionalized racism. To do so, the group will provide a space to cultivate a culture of undergraduate student activism against the injustice in the U.S. prison system and cooperate with faculty and graduate students to spread awareness primarily through screenings, speakers, and panels."}, {"name": "Students for Global Health", "description": "To promote global health undergraduate student collaboration by striving to advance student’s knowledge, opportunities, and careers in the field. We uphold an interdisciplinary alliance with diverse majors, staff, faculty, and organizations around the globe. We promote and educate members of our club and school on illness, health, and healing, through perspectives that transcend national borders and regional interests.\r\n"}, {"name": "Students for Justice in Palestine", "description": "In accordance with democratic principles, to promote justice, human rights, and the right of self-determination for the Palestinian people."}, {"name": "Students for the Exploration and Development of Space", "description": "SEDS is an independent, student-based organization which promotes the exploration and development of space.\r\nSEDS believes in a space-faring civilization and that focusing the enthusiasm of young people is the key to our future in space."}, {"name": "Sun God Archery at UCSD", "description": "The purpose of this organization is to provide the opportunity for UCSD students to compete intercollegiately, and to foster interest and participation in the sport of target archery."}, {"name": "Sustainability Ambassadors Program", "description": "The Sustainability Ambassador Program offers undergraduate students an opportunity to learn about sustainability from different perspectives. The program equips student educators with the best practices on how to connect with the student population on 6 different disciplines. The ambassadors will coordinate educational peer workshops, programming efforts, and research/ case studies. All of which will empower students to make more environmentally conscious choices and gain understanding of environmental stewardship & sustainability, leading to the efforts brought by the UC Carbon Neutrality Initiative.\r\n"}, {"name": "Swing Club at UCSD", "description": "Swing Club at UCSD Constitution\r\n\r\n\r\nPurpose: \r\nTo provide a safe and fun place for people to discuss and practice the art of swing dancing and make friends.\r\n\r\nSwing Club at UCSD is a non-profit student organization.\r\n\r\nRequirements for membership:\r\nMembership is open to all students at UCSD, undergraduate, and graduate. There are no fees. All that is required to become a member is to attend one meeting per quarter and to sign up for the emailing list at swingUCSD@gmail.com. A person should request to give up membership by asking to be removed from the emailing list by emailing swingUCSD@gmail.com. \r\n\r\nFrequency of Organization Meetings:\r\nSwing Club meetings will occur once a week for three hours, for all three quarters of the academic year. "}, {"name": "Tae Kwon Do Club at UCSD", "description": "The purpose of this student organization is to create a community where UCSD students can come together to share a mutual interest in and practice the art of Olympic Style Tae Kwon Do in a fun and safe manner, and to spread awareness of the art in an atmosphere that values and stresses resolve, diligence and above all respect."}, {"name": "Taiwanese American Student Association", "description": "The Taiwanese American Students Association (TASA) at the University of California – San Diego is an organization that provides a sense of community for Taiwanese Americans, as well as those interested in the Taiwanese culture. We create a sense of unity not only within the Taiwanese community here in San Diego, but also with students at other universities.\r\n\r\nOur organization promotes cultural awareness by building a community of motivated and dedicated students through our social, cultural, an"}, {"name": "TamashaSD", "description": " TamashaSD is a student run organization on the UC San Diego campus that aims to connect South Asian Americans back to their roots while fostering a positive cultural environment for the community. Eight Bollywood-Fusion dance teams will showcase their talent from across the nation and have the chance to compete for a first place prize. Get ready to experience amazing ocean views, unforgettable sunsets and tasty street tacos. Most of all, don’t forget to stay classy San Diego.\r\n"}, {"name": "TAMID Israel Investment Group @ UCSD", "description": "TAMID is a student-run, apolitical, and areligous organization that seeks to develop the professional skills of undergraduate students through hands-on interaction with the Israeli and American economies. TAMID's motto: experiential learning through business in Israel.\r\n\r\nTAMID provides undergraduate students with an education in the context of Israel’s dynamic economy, and members are presented with the unique opportunity to attend speaker events, grow your business knowledge base, invest in the TASE and NYSE, intern for Israeli tech firms, and consult for Israeli startups. The internationally recognized Tamid Group, headquartered in Washington D.C., has chapters on 29 campuses in the US and abroad.\r\n\r\nTAMID is partnered with leading global companies in the technology, healthcare, and finance industries to provide internship opportunities. As a member of TAMID at University of California San Diego, you can gain amazing experience on a wide range of projects and activities. Take this opportunity to meet industry leaders and work alongside some of the most innovative companies in the world."}, {"name": "Tau Beta Pi", "description": "Tau Beta Pi is the premier engineering honor society in the United States and one of the top three honor societies in the nation. The Society focuses on serving its members and the public with enthusiasm and excellence. The Association also strives to promote excellence in the fields of engineering, thus helping to improve the perception of the profession."}, {"name": "Tau Kappa Epsilon", "description": "TKE contributes to the advancement of society through the personal growth of our members and service to others.\r\n"}, {"name": "Teachers 4 Change: EDS Graduate Student Organization", "description": "Teachers 4 change is an EDS graduate student organization that aims to bridge the multiple subject and single subject cohorts in order to build social and professional networks."}, {"name": "Team HBV", "description": "Team HBV is a national network spanning many colleges and high schools whose goal is to create a strong, unified community that will further efforts to eradicate hepatitis B. The national Team HBV mission is to raise awareness of the disproportionately high incidence of hepatitis B and liver cancer among Asian and Pacific Islanders (APIs) worldwide and hopes to create programming that will address the disparity. \r\nOn the campus of UCSD, Team HBV will raise awareness on campus and in the local community through screening initiative programs, outreach campaigns, inviting guest speakers, and much more. Our objectives are to educate the community about hepatitis B and liver cancer, evaluate our efforts on our outreach and education projects, participate in national and international Team HBV efforts, and to collaborate with the other individuals and organizations that support the Jade Ribbon Campaign. \r\n\r\nWe welcome everyone to join us in our fight against hepatitis B!\r\n\r\n"}, {"name": "TEDx@UCSD", "description": "TED is an annual event that brings together the world's leading thinker and doers to share ideas that matter in any discipline - technology, entertainment, design, science, humanities, business, development. TEDx events are local, self organized events that bring people together to share a TED-like event. We hope to create a local forum for ideas within the community to inspire people to change their lives, their futures and ultimately the world."}, {"name": "Thai Student Union (TSU)", "description": "As a cultural organization, the Thai Student Union (TSU) strives to\r\nstrengthen the bond of the Thai community in San Diego while sharing the Thai\r\nculture with those outside of the Thai community. "}, {"name": "Theory of Poker", "description": "The purpose of the organization is to combine academic elements from mathematics, statistics, and economics with the fundamentals and rules of poker. Furthermore, the organization shall increase students’ previous knowledge of poker principles and provide workshops to beginners to teach them the fundamentals and the rules of the game. \r\n\r\n"}, {"name": "Theta Tau", "description": "The purpose of Theta Tau is to build a strong fraternal bond and maintain high standards of professionalism among fellow members. Theta Tau aims to provide its members the social and professional development necessary to succeed during and after their college years."}, {"name": "THRIVE", "description": "To create a program that begins to address needs of the students within the south east neighborhoods of San Diego county, specifically Sweetwater Union High School (SUHi) in National City; to help high school students realize their potential and the potential to pursue higher education including at prestigious universities such as the University of California, San Diego (UCSD); and to create a system of social support where the mentor and mentee will benefit, learn, and thrive; we propose that THRIVE be created. A buddy program between students at SUHi and students at UCSD aimed at educating both parties. Mentees from SUHi will learn about the application and acceptance process to colleges and college prerequisites, as well as what it is like to transition to being a college student. Mentors from UCSD will gain an understanding of cultural awareness and the different backgrounds and circumstances our peers come from, as well as learning to relate their own experiences to their mentee. The program will have the following guidelines:\r\n\r\nStudents:\r\nNumber of Students from University of California, San Diego: 7-8, each with one or two younger buddies\r\nNumber of Students from Sweetwater Union High School: 7-16, each with one older buddy\r\n\r\nEvents: 1 quarterly event located at UCSD (2-3 hours) - designed to educate high school students on the college admissions process, help students understand what it is like to be a college student, and gain life skills and resources to help them achieve in college. Students will also have weekly/biweekly contact w/ buddy to check in. Through email and Facebook.\r\n\r\nStudent responsibilities: 10- 15 hours a quarter for students with the option of added events and responsibilities."}, {"name": "Timothy Team", "description": "For the older generation of students to pass on, develop, equip, and mentor the new generation of students at UCSD in the areas of spiritual growth and leader development to better serve and impact the campus and the greater San Diego area."}, {"name": "Trend", "description": "Trend is a non-profit student organization that publishes a fashion magazine. It highlights the fashion of individuals and connects UCSD students to social events in the local San Diego community. The publication offers student opportunities to learn and gain experience in the media industry."}, {"name": "Triangle Fraternity", "description": "The purpose of Triangle shall be to maintain a fraternity of engineers, architects and scientists.  It shall carry out its purpose by establishing chapters that develop balanced men who cultivate high moral character, foster lifelong friendships, and live their lives with integrity."}, {"name": "Triton 3D @ UCSD", "description": "The Purpose of the club is to engage in engineering projects utilizing 3D printing as well as conducting research and educating about the technologies and capabilties of 3D Printing.  "}, {"name": "Triton Counter Strike", "description": "Triton Counter Strike is an organization encompassing all players an environment to play, socialize, and promote their enthusiasm for all Counter Strike games. We will provide events including, but not limited to: online games, offline meetings, and LANs / tournaments."}, {"name": "Triton Engineering Student Council", "description": "TESC wants to develop engineers who exhibit leadership through excellence in all aspects of life:\r\n- Prepare students for, and connect them with, professional opportunities;\r\n- Coordinate, and collaborate with, engineering student organizations;\r\n- Create and maintain a vibrant community for engineering students; and\r\n- Champion engineering and engineers in the school, community, and beyond. \r\n"}, {"name": "Triton Entrepreneurs", "description": "A community of entrepreneurs at UC San Diego."}, {"name": "Triton Gaming", "description": "Triton Gaming is a group of collegiate organizers that team up to create epic entertainment experiences for student gamers at the University of California, San Diego. Our organization is the product of several independent on-campus gaming organizations that each represent a different gaming genre and student community. Through Triton Gaming, our team strives to create an exciting, diverse, and all-inclusive gaming environment on campus through high-quality live events."}, {"name": "Triton Hearthstone", "description": "Triton Hearthstone is a student organization that strives to bring together players, spectators, and enthusiasts of the game Hearthstone in a supportive environment that promotes both competitive and casual play. Our goal is to have as much fun as we possibly can! "}, {"name": "Triton Jewish Leaders", "description": "Triton Jewish Leaders is a leadership incubator at the core of UC San Diego’s Jewish student community, mobilizing student leaders through Jewish education and individualized mentorship, thereby enabling them to put into practice their vision for Jewish student life and the wider university community. Triton Jewish Leaders reflect the diversity of the Jewish student body at UC San Diego. Identified throughout their college career as students with leadership capacity, TJL pairs each student with a mentor and educator for the entirety of their college career. Through biweekly education and mentorship, the student leader is shown the Jewish wisdom that undergirds their leadership interests, empowering them to build Jewish life on campus on their own terms."}, {"name": "Triton Melee", "description": "To expand the community of the game Super Smash Bros: Melee by offering a friendly,  interactive, and competitive environment to all student players.   "}, {"name": "Triton Overwatch", "description": "Triton Overwatch is a student organization that strives to bring together players, spectators, and enthusiasts of the game Overwatch in a supportive environment that promotes both competitive and casual play. Our goal is to have as much fun as we possibly can! "}, {"name": "Triton Pokémon Go", "description": "Triton Pokémon Go is a non-profit student organization that serves to foster a strong community for Pokémon Go enthusiasts and provide a positive environment for players at the University of California, San Diego. This will be accomplished through creating inclusive community events in which students are encouraged to meet peers and enhance their social experience. \r\n\r\n"}, {"name": "Triton Real Estate Organization", "description": "The purpose of this organization is to promote students' understanding and knowledge in the field of Real Estate. This includes many facets of Real Estate such as property management, investment and development. It also serves to establish and strengthen the network between students and business professionals within our community."}, {"name": "Triton Smash", "description": "The Triton Smash is a student run organization that promotes the competitive will to succeed in any goal, whether in gaming, social interaction, or any other aspect of life. We also strive to promote the creation of communities not solely within the UCSD community but also with other campuses around the nation through our intercollegiate gaming leagues."}, {"name": "Triton Street Fighter", "description": "Triton Street Fighter is an organization centered around playing the video game Ultra Street Fighter 4 and Street Fighter 5 once it is released next year. The focus is to establish a community of players that all share the same love and passion for the game. "}, {"name": "Triton Unmanned Aerial Systems at UCSD", "description": "We are an undergraduate engineering project team that builds an autonomous airplane to fly at the AUVSI Student Unmanned Aerial Systems Competition. The team is multi-disciplinary consisting of three subteams. The airframe team designs, analyzes and builds a reliable aerial platform to house and transport a variety of avionics packages. The embedded team designs the payload and electronics. The software team programs the ability to complete mission tasks such as autonomously recognizing targets and dynamic path planning. "}, {"name": "Triton's Ohana", "description": "We are a ukulele club at UCSD that encourages people to learn how to play the ukulele. We shall teach you the basics of the ukulele, but also encourage other musicians such as singers, guitarists, pianists, and percussionists to join us. We support giving back to the community through local performances and strive to be a culturally diverse group that is welcoming of all views and backgrounds. \r\n"}, {"name": "Tritones at UCSD", "description": "To encourage participation in the fine arts, to provide entertainment, to support all musical endeavors, to expand the genre of a cappella in the San Diego region."}, {"name": "Tritons for Bernie", "description": "The purpose of this organization is to promote the political revolution on campus, in the San Diego region, in California and across the United States and to help elect Bernie Sanders as President of the United States and people who promote his policies to other Local, State and Federal offices."}, {"name": "Tritons for Hillary", "description": "We are Tritons unified in support of the candidacy of Hillary Rodham Clinton for the Democratic Party's nomination  and her general election campaign for President of the United States. "}, {"name": "Tritons For Israel", "description": "Tritons for Israel is the Pro-Israel student organization at UCSD. We are dedicated to raising awareness about Israel and Israeli culture, educating students, and promoting peace in the Middle East. "}, {"name": "Tritons for Peters", "description": "The purpose of Tritons for Peters shall be to bring the message of the re-election of Congressman Scott Peters in the 2016 general election to the UCSD student body. This organization shall serve as the official representation of the Scott Peters for Congress campaign on the UCSD campus by: Disseminating the message of the campaign to the student body; Signing up students as supporters and volunteers for the campaign; and registering students to vote in 2016 election."}, {"name": "Tritons for Sally Ride Science", "description": "The purpose of Tritons for Sally Ride Science is to promote K-12 STEM education and generally broaden STEM participation. Through mentoring and exciting K-12 students, we hope to promote science literacy and awareness.\r\n\r\n"}, {"name": "Tritons for UNICEF", "description": "To educate, advocate, and fundraise on behalf of children and in support of UNICEF’s lifesaving work."}, {"name": "TSH ( Transfer Students for Health )", "description": "The Purpose of this organization is to bring together a community of  unique, nontraditional pre-health professionals on campus. This Organization is mainly to serve pre-health and life sciences transfer students. \t\t\t\tHowever, other students can participate too. These students including but not limited to first-generation college students, students considering a health profession and pursuing a major in \tdepartments other than biology and chemistry, students belonging to demographics that are underserved in health professions, \t\t\t\tstudents returning to school after several years in the workforce and considering a health profession.\r\n"}, {"name": "Turkish Student Association", "description": "To promote Turkish culture and improve communication and cooperation among Turkish students at UCSD."}, {"name": "Turning Point USA at UCSD", "description": "Educate students about the importance of fiscal responsibility, limited government, and free markets. "}, {"name": "Tzu Chi Collegiate Association at UCSD", "description": "Tzu Chi Collegiate Association at UCSD is a non-profit student organization, which aims to inspire college-level students in the mindful practice of the Tzu Chi Foundation’s principles of Love, Respect, and Gratitude through service at the community level. Tzu Ching promote the universal value of “Great Love” through the Tzu Chi Foundation’s missions of Charity, Medicine, Education, Culture, International Relief, Bone Marrow Donation, Environmental Protection and Community Service. Through mindful practice of Founder Dharma Master Cheng Yen’s teachings, Tzu Ching hope to purify people's minds and bring positive influence into the community."}, {"name": "Undergraduate Accounting Society", "description": "To promote UCSD's accounting program and provide career insight and opportunities for prospective undergraduate students.  "}, {"name": "Undergraduate Bioinformatics Club at UCSD (UBIC)", "description": "The Undergraduate Bioinformatics Club (UBIC) at UCSD shall be a non-profit organization whose purpose is to serve bioinformatics undergraduates by providing resources for students entering the growing discipline; furthering access to job, internship, and research opportunities; facilitating an open forum for discussion, collaboration, and socialization; holding events, programs, and meetings; and acting as a collective voice for bioinformatics students at UCSD."}, {"name": "Undergraduate Business Network (formerly Undergraduate Business Association)", "description": "Undergraduate Business Network is a pre-professional student organization that strives to be a resource for undergraduate students who are interested in the field of business. By providing mentorship, networking opportunities, and workshops for essential business skills, UBN offers valuable career development at the University of California, San Diego. Despite the diverse set of majors and career goals that members pursue, the organization consists of driven individuals who are united by a common interest in business. UBN is a non-profit student organization."}, {"name": "Undergraduate Communication Society at UCSD", "description": "The Undergraduate Communication Society (UCS) is an organization run by and for students interested in communication. The UCS conducts career panels, field trips  (in which we are not responsible for member's transportation and utilize public transportation throughout San Diego) and social events for members, often including alumni and guest speakers from the communication field."}, {"name": "Undergraduate Economic Society", "description": "The purpose of the Organization is to create a community of students and faculty members defined by an interest in the study of Economics."}, {"name": "Undergraduate Investment Society", "description": "To empower students with financial knowledge."}, {"name": "Undergraduate Women in Computing at UCSD", "description": "WIC is a non-profit student organization committed to fostering a supportive and informative environment for women in the Computer Science and Engineering department through technical, professional development, and social events. We also focus on high school outreach programs to bring more young women into the field. Keynote speakers, career fair information, interview preparation, and awareness about relevant CS conferences are few of the opportunities that will be provided for our members."}, {"name": "Undergraduate Women in Physics", "description": "The Undergraduate Women in Physics is a student organization dedicated to promoting women in physics by providing access to a network and community for women in physics, as well as support in pursuing research and higher education. Our purpose is also to improve the physics community in UCSD and to promote interactions between the faculty, undergraduates and graduate students of the Physics department and help people recognize and appreciate women in physics."}, {"name": "Union of Jewish Students", "description": "The Union of Jewish Students at the University of California, San Diego exists to address the needs of the Jewish community on campus and to provide framework for pluralistic Jewish life on campus through social, cultural, religious, and educational programming. The Union of Jewish Students serves:\r\n*Students who identify as Jewish\r\n*Students who have Jewish heritage\r\n*Students who support the celebration of Jewish culture\r\n*Students who desire to learn more about Jewish culture\r\n*Students interested in contributing to a vibrant, pluralistic Jewish community\r\n*Students who would like to engage in Jewish culture-­related traditions and/or religious observance activities\r\n*Students who are interested in the history of the Jewish people\r\nThe Union of Jewish Students is a non­-profit organization."}, {"name": "Unitarian Universalists at UCSD", "description": "The purpose of the Unitarian Universalists at UCSD is to provide opportunities for the expression and exploration of liberal religious and spiritual values and spirituality without dogma at the UCSD campus.  "}, {"name": "United Taiwanese Association", "description": "United Taiwanese Association was created to promote the Taiwanese culture through a number of traditional and cultural events that are representative of Taiwan. These events also sought to provide a sense of familiarity and home for students that have recently immigrated to the United States from Taiwan. UTA also hosts a number of social events on top of its cultural events to serve as the bridge for its diverse members group."}, {"name": "Vagina Monologues V-Day @ UCSD", "description": "Through the production, \"The Vagina Monologues,\" V-Day @ UCSD raises money and awareness to fight violence against women and girls.  We are a not-for-profit student-run community service organization."}, {"name": "Video Game Development Club", "description": "The Video Game Development Club seeks to bring students who are interested in the process of video game design and development together in a collaborative environment. Students can develop games from start to finish with their peers, and seek feedback and assistance with ideas and projects they may be working on."}, {"name": "Vietnamese Student Association", "description": "To promote and preserve the Vietnamese culture and awareness among the UCSD students through various cultural, social, community, and educational events"}, {"name": "Virtual Reality Club at UCSD", "description": "The purpose of the Virtual Reality Club at UCSD is to provide a common place \r\nwhere students that are interested in Virtual Reality or Augmented Reality can go \r\nto learn more about this new and exciting technology."}, {"name": "We The Redeemed", "description": "Provide a Christian environment and circle for UCSD students through activities such as worship, prayer, bible study, and fellowship."}, {"name": "West African Dance", "description": "The West African Dance org creates a dancing space for those who love to dance to West African music and to teach members several West African dance moves that will be performed at special occasions."}, {"name": "Women in Business", "description": "UCSD Women In Business aims to empower women of all backgrounds to become leaders in today's ever-changing world. Through business education, networking, mentorship, leadership development workshops, and social events, members will have the chance to join a community dedicated to helping one another succeed. By encouraging both professional and personal growth, UCSD WIB will give women pursuing business the chance to affect change not only within themselves and the university, but in the world they seek beyond."}, {"name": "Women in ECE (WeCe)", "description": "To build a community among graduate women in Electrical and Computer Engineering to enhance their career opportunities.  "}, {"name": "Women in Politics", "description": "Leading, creating opportunities, networking, teaching.\r\n\r\n1. Promoting female leadership in politics and the law\r\n2. Creating a pipeline for UCSD undergraduates to political jobs in Washington\r\n3. Representing women of all colors in government\r\n4. Networking with people from around the country in our prospective fields and beyond\r\n5. Using our knowledge to educate other students, inspiring women to pursue broader avenues than may appear to be readily available\r\n"}, {"name": "Women SPEAK", "description": "The purpose of Women SPEAK is to promote girls' health and leadership by cultivating positive body image, establish healthy relationships, defy and deconstruct gender media stereotypes, and become leaders of change in their local communities. "}, {"name": "Wrestling Club", "description": "To provide a club that allows students to train and compete in collegiate wrestling."}, {"name": "Wushu club @ UCSD", "description": "The primary purpose of the Wushu Club is to provide any individual with the opportunity to be introduced to and learn wushu in a friendly and safe environment. The secondary purpose of the club is to introduce and prepare intermediate members for intercollegiate competitions such as the annual UC Berkeley wushu tournament. The Wushu Club at UCSD is a non-profit student organization."}, {"name": "Yonder Dynamics", "description": "Yonder Dynamics is a student team working to build autonomous rovers for planetary exploration. Through this process students will gain hands-on experience working in the fields of mechanical and aerospace engineering and robotics, and will have the opportunity to compete in design competitions and attend conferences."}, {"name": "Young Americans for Liberty (formerly known as College Libertarians)", "description": "The mission of Young Americans for Liberty (University of California, San Diego Chapter)\r\nis to train, educate, and mobilize the youth towards a more free society.\r\n\r\nOur goal is to cast the leaders of tomorrow and reclaim the policies, candidates, and direction of our government, and spread the ideas of limited government, free markets, sound money, non-intervention, and maximum individual liberty at University of California, San Diego.\r\n"}, {"name": "Young Life", "description": "To create an inclusive community on campus that displays the love God has for us in a fun, easy to connect with way, to be inclusive and accepting to anyone and everyone on campus, and to live life to the fullest in the way God means for us to live."}, {"name": "Zion Bible Study Club", "description": "Primarily focusing on studying the bible, Zion Bible Study Club offers members the\r\nopportunity to distinguish between what the bible teaches and the traditions of men."}, {"name": "Zor at UCSD (Hindi Film) Dance Team", "description": "To explore and express aspects of South Asian culture through Bollywood Dance."}]}